export interface QuestionData {
  question: string;
  options: Record<string, string>;
  correctAnswer: string;
}

export const russianTestQuestions: Record<number, QuestionData[]> = {
  1: [
    {
      question: "Что изучает теория и методика физической культуры:",
      options: {
        "A": "Закономерности обучения.",
        "B": "Закономерности воспитания.",
        "C": "Общие закономерности физической культуры.",
        "D": "Возрастные закономерности человека."
      },
      correctAnswer: "C"
    },
    {
      question: "Какой вид физической культуры обеспечивает основную базовую физическую подготовку:",
      options: {
        "A": "Спорт.",
        "B": "Школьная физическая культура.",
        "C": "Оздоровительно-рекреативный вид физической культуры.",
        "D": "Оздоровление."
      },
      correctAnswer: "B"
    },
    {
      question: "К движению в пространственно-временном единстве движения относится:",
      options: {
        "A": "Стремительность.",
        "B": "Ритм.",
        "C": "Амплитуда.",
        "D": "Скорость."
      },
      correctAnswer: "D"
    },
    {
      question: "Какие методы обучения чаще всего применяются на начальном этапе изучения сложных движений:",
      options: {
        "A": "Метод расчлённого обучения упражнениям.",
        "B": "Метод стандартно-прерывистых упражнений.",
        "C": "Метод сопряжённого воздействия.",
        "D": "Метод целостного обучения упражнениям."
      },
      correctAnswer: "A"
    },
    {
      question: "Определите основную организованную форму физических упражнений в общеобразовательных школах:",
      options: {
        "A": "Физкультурно-оздоровительные мероприятия в распорядке дня.",
        "B": "Массово-спортивные и туристические мероприятия.",
        "C": "Урок физической культуры.",
        "D": "Тренировочные занятия в спортивной секции."
      },
      correctAnswer: "C"
    },
    {
      question: "Это — ослабление организма, возникающее в результате деятельности, характеризующее снижение работоспособности:",
      options: {
        "A": "Бодрое настроение.",
        "B": "Открытие аппетита.",
        "C": "Увеличение массы тела.",
        "D": "Утомление."
      },
      correctAnswer: "D"
    },
    {
      question: "При прыжке на гимнастических снарядах необходимо обязательно приземляться:",
      options: {
        "A": "На левую ногу с согнутым коленом.",
        "B": "На обе ноги с согнутыми коленями.",
        "C": "На правую ногу с согнутым коленом.",
        "D": "На пятки с согнутыми коленями."
      },
      correctAnswer: "B"
    },
    {
      question: "Упражнения, определяющие выносливость:",
      options: {
        "A": "Кардиотренировка, бег, подтягивание на перекладине.",
        "B": "Развитие силы, плавание, фитнес.",
        "C": "Статические и динамические упражнения.",
        "D": "Гибкость, статика."
      },
      correctAnswer: "A"
    },
    {
      question: "Количество технических действий, доступных баскетболистам:",
      options: {
        "A": "Около 70.",
        "B": "Около 80.",
        "C": "Около 60.",
        "D": "Около 90."
      },
      correctAnswer: "C"
    },
    {
      question: "Игрок в футболе, форма которого отличается от остальных:",
      options: {
        "A": "Капитан.",
        "B": "Защитник.",
        "C": "Вратарь.",
        "D": "Нападающий."
      },
      correctAnswer: "C"
    },
    {
      question: "Командные действия в нападении в гандболе:",
      options: {
        "A": "Состоит из согласованных действий отдельных игроков.",
        "B": "Состоит из действий отдельного игрока по владению мячом.",
        "C": "Состоит из защитных действий отдельного игрока.",
        "D": "Состоит из постановки заслонов отдельными игроками."
      },
      correctAnswer: "A"
    },
    {
      question: "Масса ядра, используемого женщинами:",
      options: {
        "A": "2 кг.",
        "B": "3 кг.",
        "C": "5 кг.",
        "D": "4 кг."
      },
      correctAnswer: "D"
    },
    {
      question: "Вид спортивных игр:",
      options: {
        "A": "Гимнастика.",
        "B": "Национальные игры.",
        "C": "Футбол.",
        "D": "Групповые игры."
      },
      correctAnswer: "C"
    },
    {
      question: "Какое утверждение наиболее корректно отражает значение гена ACTN3 в спортивной адаптации?",
      options: {
        "A": "Ген ACTN3 определяет исключительно выносливость и не влияет на скоростные качества.",
        "B": "ACTN3 регулирует синтез инсулина при физической нагрузке.",
        "C": "Наличие определённых вариантов ACTN3 может предрасполагать к развитию скоростно-силовых способностей.",
        "D": "Данный ген отвечает за формирование медленных мышечных волокон вне зависимости от тренировки."
      },
      correctAnswer: "C"
    },
    {
      question: "Какое состояние, вызванное хроническим утомлением и перетренированностью, является причиной развития печёночно-болевого синдрома?",
      options: {
        "A": "Повышенное образование белков и замедленный распад жиров.",
        "B": "Снижение уровня глюкозы в крови.",
        "C": "Повышенный распад белков и замедленное их образование.",
        "D": "Нарушение водно-солевого баланса."
      },
      correctAnswer: "B"
    },
    {
      question: "Какую форму имеют плотные клетки в дистальных канальцах почек:",
      options: {
        "A": "Плоскую.",
        "B": "Отростчатую.",
        "C": "Круглую.",
        "D": "Призматическую."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое движение связано с изменением угловой позиции тела или предмета?",
      options: {
        "A": "Вращательное движение.",
        "B": "Прямолинейное движение.",
        "C": "Линейное движение.",
        "D": "Вибрационное движение."
      },
      correctAnswer: "A"
    },
    {
      question: "Какое состояние может развиться при длительном применении стимуляторов на фоне интенсивных нагрузок?",
      options: {
        "A": "Физиологическая гипертрофия сердца.",
        "B": "Кардиомиопатия и нарушение ритма.",
        "C": "Повышение эластичности миокарда.",
        "D": "Улучшение коронарного кровообращения."
      },
      correctAnswer: "C"
    },
    {
      question: "Назовите функции крови:",
      options: {
        "A": "Питательная.",
        "B": "Дыхательная.",
        "C": "Выделительная.",
        "D": "Всё вышеперечисленное верно."
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогика — это:",
      options: {
        "A": "Наука о спорте.",
        "B": "Раздел философии.",
        "C": "Наука о воспитании, обучении и развитии личности.",
        "D": "Методика тренировки."
      },
      correctAnswer: "C"
    },
    {
      question: "Эмпирические методы — это:",
      options: {
        "A": "Планирование.",
        "B": "Наблюдение и эксперимент.",
        "C": "Объяснение.",
        "D": "Лекция."
      },
      correctAnswer: "B"
    },
    {
      question: "Рефлексия — это:",
      options: {
        "A": "Соревнование.",
        "B": "Наказание.",
        "C": "Тестирование.",
        "D": "Анализ собственной деятельности."
      },
      correctAnswer: "D"
    },
    {
      question: "Личностно-ориентированное обучение предполагает:",
      options: {
        "A": "Учёт индивидуальности обучающегося.",
        "B": "Одинаковые требования.",
        "C": "Строгий контроль.",
        "D": "Минимальную активность."
      },
      correctAnswer: "A"
    },
    {
      question: "Ответственность педагога включает:",
      options: {
        "A": "Усиление контроля.",
        "B": "Наказывать обучающихся.",
        "C": "Обеспечение безопасности обучающихся.",
        "D": "Часто организовывать соревнования."
      },
      correctAnswer: "C"
    },
    {
      question: "Метод убеждения — это:",
      options: {
        "A": "Наказание.",
        "B": "Соревнование.",
        "C": "Контроль.",
        "D": "Воздействие на сознание и взгляды обучающихся."
      },
      correctAnswer: "D"
    }
  ],
  2: [
    {
      question: "Как называется направление, имеющее целью выявление новых знаний, воздействия факторов физической культуры, закономерностей совершенствования физической подготовки человека:",
      options: {
        "A": "Наука физической культуры и спорта.",
        "B": "История физической культуры и спорта.",
        "C": "Наука в сфере физической культуры и спорта.",
        "D": "Методика выбранного вида спорта."
      },
      correctAnswer: "C"
    },
    {
      question: "Урок физической культуры в общеобразовательной школе:",
      options: {
        "A": "Урок прикладной физической подготовки.",
        "B": "Базовый вид урока физической культуры.",
        "C": "Лечебный вид урока.",
        "D": "Спортивный вид урока."
      },
      correctAnswer: "B"
    },
    {
      question: "К динамическим характеристикам физических упражнений относится:",
      options: {
        "A": "Ритм.",
        "B": "Темп.",
        "C": "Ускорение.",
        "D": "Силовой импульс."
      },
      correctAnswer: "D"
    },
    {
      question: "Основные признаки двигательного навыка: привлечение внимания.",
      options: {
        "A": "Автоматизированное управление движением.",
        "B": "Нестабильность при выполнении движения.",
        "C": "Особая устойчивость при выполнении приёма движения.",
        "D": "Факторы нестабилизации движения."
      },
      correctAnswer: "A"
    },
    {
      question: "Раздел, анализируемый учителем первым при анализе плана урока:",
      options: {
        "A": "Подготовительная часть.",
        "B": "Заключительная часть.",
        "C": "Основная часть.",
        "D": "Вводная часть."
      },
      correctAnswer: "A"
    },
    {
      question: "Наиболее распространённый и быстрый вид плавания:",
      options: {
        "A": "Брасс.",
        "B": "Плавание на спине.",
        "C": "Дельфин.",
        "D": "Кроль."
      },
      correctAnswer: "D"
    },
    {
      question: "11-метровый штрафной удар в футболе:",
      options: {
        "A": "Финт.",
        "B": "Пенальти.",
        "C": "Аут.",
        "D": "Комбинация."
      },
      correctAnswer: "B"
    },
    {
      question: "При игре в баскетбол для предотвращения травмы следует помнить:",
      options: {
        "A": "При ловле мяча нельзя направлять большой палец навстречу мячу.",
        "B": "Нельзя прыгать высоко.",
        "C": "Нужно держать пальцы согнутыми.",
        "D": "Нельзя быстро бежать."
      },
      correctAnswer: "A"
    },
    {
      question: "Вид игр, развивающий командный дух в подвижных играх:",
      options: {
        "A": "Логические игры.",
        "B": "Эстафетные игры.",
        "C": "Ролевые игры.",
        "D": "Индивидуальные игры."
      },
      correctAnswer: "B"
    },
    {
      question: "В гандболе вратарю запрещается:",
      options: {
        "A": "Касаться мяча любой частью тела в площади ворот.",
        "B": "Передвигаться с мячом в площади ворот, только не держать долго.",
        "C": "Не создавать угрозу сопернику при защите ворот.",
        "D": "Играть без мяча вне площади ворот."
      },
      correctAnswer: "D"
    },
    {
      question: "Наиболее эффективная тактика для нападающего в баскетболе:",
      options: {
        "A": "Выбор эффективного времени в игре.",
        "B": "Не обращать внимания на соперника.",
        "C": "Только быстро бежать.",
        "D": "Долго держать мяч."
      },
      correctAnswer: "A"
    },
    {
      question: "Упражнения, улучшающие показатели двигательных качеств учащихся с точки зрения эстетики движения:",
      options: {
        "A": "Упражнения для развития силы.",
        "B": "Строевые упражнения.",
        "C": "Упражнения для развития скорости.",
        "D": "Упражнения ритмической гимнастики."
      },
      correctAnswer: "D"
    },
    {
      question: "Пенальти в футболе:",
      options: {
        "A": "Серия после игры с 10 м, нарушение правил.",
        "B": "Серия после игры с 12 м, нарушение правил.",
        "C": "Серия после игры с 11 м, нарушение правил.",
        "D": "Серия после игры с 9 м, нарушение правил."
      },
      correctAnswer: "C"
    },
    {
      question: "Какова физиологическая роль гормонов щитовидной железы при физической нагрузке?",
      options: {
        "A": "Исключительно регуляция белкового обмена.",
        "B": "Подавление катаболических процессов.",
        "C": "Участие в регуляции всех видов обмена и усиление липидного обмена при мышечной работе.",
        "D": "Снижение основного обмена для экономии энергии."
      },
      correctAnswer: "C"
    },
    {
      question: "Волокна белого вещества, соединяющие головной и спинной мозг:",
      options: {
        "A": "Коллаген.",
        "B": "Миелиновые волокна.",
        "C": "Эластин.",
        "D": "Преколлаген."
      },
      correctAnswer: "B"
    },
    {
      question: "Какие люди относятся к типу телосложения эктоморф:",
      options: {
        "A": "Мускулистый, сильный тип телосложения.",
        "B": "Округлый, мягкий тип телосложения.",
        "C": "Склонный к накоплению жира.",
        "D": "Стройный, длиннотелый тип."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое сокращение происходит при опускании гантели?",
      options: {
        "A": "Эксцентрическое.",
        "B": "Изометрическое.",
        "C": "Концентрическое.",
        "D": "Изотоническое."
      },
      correctAnswer: "A"
    },
    {
      question: "Какой показатель чаще всего используют для оценки реакции сердечно-сосудистой системы на нагрузку?",
      options: {
        "A": "Артериальное давление.",
        "B": "Масса тела.",
        "C": "Частота сердечных сокращений.",
        "D": "Температура тела."
      },
      correctAnswer: "C"
    },
    {
      question: "Сколько в среднем живёт эритроцит?",
      options: {
        "A": "20 дней.",
        "B": "40 дней.",
        "C": "80 дней.",
        "D": "120 дней."
      },
      correctAnswer: "D"
    },
    {
      question: "Объект педагогики — это:",
      options: {
        "A": "Спортивные соревнования.",
        "B": "Учебный план.",
        "C": "Целостный педагогический процесс.",
        "D": "Нормативные документы."
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогический эксперимент — это:",
      options: {
        "A": "Соревнование.",
        "B": "Проверка гипотезы в практике обучения.",
        "C": "Тренировка.",
        "D": "Экзамен."
      },
      correctAnswer: "B"
    },
    {
      question: "Воспитание — это:",
      options: {
        "A": "Контроль знаний.",
        "B": "Соревнование.",
        "C": "Отдых.",
        "D": "Целенаправленный процесс формирования личности."
      },
      correctAnswer: "D"
    },
    {
      question: "Дистанционное обучение — это:",
      options: {
        "A": "Обучение с использованием цифровых технологий.",
        "B": "Смотреть соревнования по телевизору.",
        "C": "Делать упражнения в тренажёрном зале.",
        "D": "Сдавать экзамен в аудитории."
      },
      correctAnswer: "A"
    },
    {
      question: "Охрана труда предполагает:",
      options: {
        "A": "Увеличение нагрузки.",
        "B": "Привлечение обучающихся к участию в соревнованиях.",
        "C": "Соблюдение норм безопасности.",
        "D": "Виды контроля."
      },
      correctAnswer: "C"
    },
    {
      question: "Метод поощрения предполагает:",
      options: {
        "A": "Снижение требований.",
        "B": "Наказание.",
        "C": "Игнорирование.",
        "D": "Стимулирование положительного поведения."
      },
      correctAnswer: "D"
    }
  ],
  3: [
    {
      question: "Какой раздел теории и методики физической культуры изучает теоретические и методические положения:",
      options: {
        "A": "Спортивная тренировка.",
        "B": "Профессионально-прикладная подготовка.",
        "C": "Общие основы теории и методики физической культуры.",
        "D": "Теория и методика физического воспитания учащихся."
      },
      correctAnswer: "C"
    },
    {
      question: "Что послужило основанием для возникновения физического воспитания в обществе: необходимость предварительной подготовки и налаживания взаимодействия.",
      options: {
        "A": "Результат научного исследования.",
        "B": "Осознанное понимание людьми упражнений, содержание, пути и прогрессивное значение гармоничного воспитания и развития человека.",
        "C": "Содержание, пути и средства гармоничного воспитания и развития человека.",
        "D": "Трудовая деятельность."
      },
      correctAnswer: "B"
    },
    {
      question: "Ритмичность — отражение комплексного характера техники физических упражнений: последовательность динамических изменений. действий.",
      options: {
        "A": "Частота движения в единицу времени.",
        "B": "Совместные внутренние и внешние силы движения в движении.",
        "C": "Точность и конечный результат движения.",
        "D": "Закономерность регулирования силы во времени и пространстве, последовательность динамических изменений движения."
      },
      correctAnswer: "D"
    },
    {
      question: "Высокий уровень овладения техникой:",
      options: {
        "A": "Двигательный навык.",
        "B": "Двигательное умение.",
        "C": "Мастерство техники.",
        "D": "Двигательная одарённость."
      },
      correctAnswer: "C"
    },
    {
      question: "В баскетболе нельзя вести мяч:",
      options: {
        "A": "Попеременно двумя руками.",
        "B": "Правой рукой.",
        "C": "Одновременно двумя руками.",
        "D": "Левой рукой."
      },
      correctAnswer: "C"
    },
    {
      question: "Подтянутое, прямое, без напряжения мышц положение, пятки вместе, носки слегка врозь, руки опущены вдоль тела, пальцы полусогнуты, смотреть прямо вперёд:",
      options: {
        "A": "В шеренге.",
        "B": "Вольно.",
        "C": "В кругу.",
        "D": "В строю."
      },
      correctAnswer: "D"
    },
    {
      question: "Особенность метода «зонной защиты» в баскетболе:",
      options: {
        "A": "Защищаться всей командой вместе.",
        "B": "Каждый игрок защищает свою зону.",
        "C": "Защищать только одного игрока.",
        "D": "Обращать внимание только на соперника."
      },
      correctAnswer: "B"
    },
    {
      question: "Приём выполняется с одной ногой впереди, вес тела равномерно распределён на две ноги, грудь слегка наклонена в сторону бросающей руки (гандбол):",
      options: {
        "A": "Передача сверху.",
        "B": "Передача из-за спины.",
        "C": "Передача снизу.",
        "D": "Передача сбоку."
      },
      correctAnswer: "A"
    },
    {
      question: "Общее количество камешков, выдаваемых игрокам для игры в тогызкумалак:",
      options: {
        "A": "9.",
        "B": "162.",
        "C": "18.",
        "D": "81."
      },
      correctAnswer: "B"
    },
    {
      question: "Положение тела при плавании вольным стилем (кроль на груди):",
      options: {
        "A": "Под водой.",
        "B": "Голова в воде.",
        "C": "Горизонтально.",
        "D": "На спине."
      },
      correctAnswer: "C"
    },
    {
      question: "Последовательность при прямой подаче мяча сверху в волейболе:",
      options: {
        "A": "Подбросить мяч вверх, замахнуться, ударить.",
        "B": "Подбросить мяч снизу, замахнуться, ударить.",
        "C": "Подбросить мяч сверху вниз, замахнуться, ударить.",
        "D": "Подбросить мяч снизу, замахнуться, ударить двумя руками."
      },
      correctAnswer: "A"
    },
    {
      question: "Упражнения, способствующие сохранению и развитию гибкости тела в пределах нормальной индивидуальной амплитуды движения:",
      options: {
        "A": "Общеразвивающие упражнения.",
        "B": "Вольные упражнения.",
        "C": "Упражнения на растяжку.",
        "D": "Упражнения на растяжение."
      },
      correctAnswer: "D"
    },
    {
      question: "Общее количество отаулов на игровой доске в тогызкумалак:",
      options: {
        "A": "2.",
        "B": "81.",
        "C": "18.",
        "D": "9."
      },
      correctAnswer: "D"
    },
    {
      question: "В чём заключается сущность двигательного навыка с физиологической точки зрения?",
      options: {
        "A": "Простое повторение ранее существовавшей безусловной реакции.",
        "B": "Реализация врождённого двигательного акта без участия коры больших полушарий.",
        "C": "Образование оперантных (инструментальных) временных связей, включающих афферентные и эфферентные звенья двигательной реакции.",
        "D": "Формирование исключительно сенсорных связей."
      },
      correctAnswer: "C"
    },
    {
      question: "Какие различия между серым и белым веществом спинного мозга?",
      options: {
        "A": "Есть миелинизированные волокна.",
        "B": "Есть нервные клетки.",
        "C": "Коллагеновые волокна.",
        "D": "Эластиновые волокна."
      },
      correctAnswer: "B"
    },
    {
      question: "Что является ключевым аспектом анализа техники в спортивной биомеханике?",
      options: {
        "A": "Оценка внешних факторов, таких как спортивное оборудование и окружающая среда.",
        "B": "Разработка спортивных программ питания и диет.",
        "C": "Анализ эмоциональных реакций спортсмена на выполнение упражнения.",
        "D": "Анализ сил, воздействующих на тело спортсмена, и их распределение во время выполнения упражнения."
      },
      correctAnswer: "D"
    },
    {
      question: "Какой угол отталкивания наиболее эффективен при прыжках в длину?",
      options: {
        "A": "45 градусов.",
        "B": "30 градусов.",
        "C": "90 градусов.",
        "D": "60 градусов."
      },
      correctAnswer: "A"
    },
    {
      question: "Ответная реакция организма, которая возникает при раздражении рецепторов с участием отделов центральной нервной системы, называется:",
      options: {
        "A": "Лабильностью.",
        "B": "Нервным центром.",
        "C": "Рефлексом.",
        "D": "Стимулом."
      },
      correctAnswer: "C"
    },
    {
      question: "Какие разновидности крови вы знаете:",
      options: {
        "A": "Артериальная.",
        "B": "Венозная.",
        "C": "Циркуляторная.",
        "D": "Всё вышеперечисленное верно."
      },
      correctAnswer: "D"
    },
    {
      question: "Предмет педагогики — это:",
      options: {
        "A": "Техника упражнений.",
        "B": "Медицинские показатели.",
        "C": "Закономерности воспитания и обучения.",
        "D": "Контроль знаний."
      },
      correctAnswer: "C"
    },
    {
      question: "Наблюдение — это:",
      options: {
        "A": "Контроль знаний обучающихся.",
        "B": "Целенаправленное восприятие педагогических явлений.",
        "C": "Контроль дисциплины.",
        "D": "Оценивание."
      },
      correctAnswer: "B"
    },
    {
      question: "Нравственное воспитание направлено на:",
      options: {
        "A": "Развитие силы.",
        "B": "Гибкость.",
        "C": "Выносливость.",
        "D": "Формирование моральных ценностей."
      },
      correctAnswer: "D"
    },
    {
      question: "Игровые технологии предполагают:",
      options: {
        "A": "Использование игры как метода обучения.",
        "B": "Использование как метода наказания.",
        "C": "Использование как метода контроля.",
        "D": "Проводить лекцию."
      },
      correctAnswer: "A"
    },
    {
      question: "Тренерская деятельность — это:",
      options: {
        "A": "Судейство.",
        "B": "Менеджмент.",
        "C": "Педагогический процесс обучения и воспитания спортсменов.",
        "D": "Медицинская деятельность."
      },
      correctAnswer: "C"
    },
    {
      question: "Метод требования — это:",
      options: {
        "A": "Поощрение.",
        "B": "Соревнование.",
        "C": "Наблюдение.",
        "D": "Предъявление норм и правил поведения."
      },
      correctAnswer: "D"
    }
  ],
  4: [
    {
      question: "Как называется вид воспитания, обучение движениям, развитие двигательных качеств, освоение специальных знаний физической культуры:",
      options: {
        "A": "Физическая культура.",
        "B": "Физическая подготовка.",
        "C": "Физическое воспитание.",
        "D": "Знания физического воспитания."
      },
      correctAnswer: "C"
    },
    {
      question: "Исторический тип социального опыта физического воспитания, мировоззрение, научно-методическая и организационная основа, обеспечивающая физическое совершенствование людей и формирование здорового образа жизни:",
      options: {
        "A": "Валеология.",
        "B": "Система физического воспитания.",
        "C": "Физическая культура.",
        "D": "Спорт."
      },
      correctAnswer: "B"
    },
    {
      question: "Приём в физическом воспитании — это выполнение движения:",
      options: {
        "A": "Определение исходного положения, содержания, организации форм обучения.",
        "B": "Условия управления, причины выполнения упражнений.",
        "C": "Конкретные причины выполнения движений.",
        "D": "Способ выполнения физического упражнения."
      },
      correctAnswer: "D"
    },
    {
      question: "Двигательное качество — это комплексная способность, отражающая особенности.",
      options: {
        "A": "Врождённое морфофункциональное качество.",
        "B": "Уровень, определяющий двигательные возможности человека, его индивидуальные особенности.",
        "C": "Способность человека, проявляющаяся в конкретном двигательном действии.",
        "D": "Конкретный результат, достигаемый при занятиях физической культурой и спортом."
      },
      correctAnswer: "C"
    },
    {
      question: "Ширина коридора для метания гранаты:",
      options: {
        "A": "12 м.",
        "B": "8 м.",
        "C": "10 м.",
        "D": "15 м."
      },
      correctAnswer: "C"
    },
    {
      question: "В тогызкумалак «домом» с нечётным количеством камешков называют:",
      options: {
        "A": "Атсуратов.",
        "B": "Закрытый дом.",
        "C": "Фасадный.",
        "D": "Открытый дом."
      },
      correctAnswer: "D"
    },
    {
      question: "Длина футбольного поля:",
      options: {
        "A": "120–140 м.",
        "B": "100–110 м.",
        "C": "60–80 м.",
        "D": "80–100 м."
      },
      correctAnswer: "B"
    },
    {
      question: "Виды катания на коньках:",
      options: {
        "A": "3.",
        "B": "4.",
        "C": "2.",
        "D": "1."
      },
      correctAnswer: "C"
    },
    {
      question: "Популярный и быстрый способ плавания:",
      options: {
        "A": "Брасс.",
        "B": "Кроль.",
        "C": "Дельфин.",
        "D": "Баттерфляй."
      },
      correctAnswer: "B"
    },
    {
      question: "Минимальное количество камешков для победы в тогызкумалак:",
      options: {
        "A": "79.",
        "B": "81.",
        "C": "82.",
        "D": "80."
      },
      correctAnswer: "C"
    },
    {
      question: "Технический приём в волейболе — удар одной рукой, завершающийся опусканием мяча на сторону соперника через верхний край сетки:",
      options: {
        "A": "Нападающий удар.",
        "B": "Подъём мяча.",
        "C": "Блок.",
        "D": "Подача."
      },
      correctAnswer: "A"
    },
    {
      question: "Выполняется на бревне или гимнастической скамейке:",
      options: {
        "A": "Строевые упражнения.",
        "B": "Беговые упражнения.",
        "C": "Утренняя гимнастика.",
        "D": "Упражнения на равновесие."
      },
      correctAnswer: "D"
    },
    {
      question: "Количество казанов на игровой доске тогызкумалак:",
      options: {
        "A": "9.",
        "B": "81.",
        "C": "2.",
        "D": "18."
      },
      correctAnswer: "C"
    },
    {
      question: "Что характерно для динамического стереотипа при формировании двигательного навыка?",
      options: {
        "A": "Полное отсутствие устойчивой последовательности фаз движения.",
        "B": "Формирование только при ациклических упражнениях.",
        "C": "Стабильная система последовательно сменяющихся фаз движения, особенно выраженная в циклических упражнениях.",
        "D": "Исключительно врождённый характер."
      },
      correctAnswer: "C"
    },
    {
      question: "Где располагаются гладкие мышечные клетки в сердце?",
      options: {
        "A": "В миокарде.",
        "B": "В эндокарде.",
        "C": "В эпикарде.",
        "D": "В перикарде."
      },
      correctAnswer: "A"
    },
    {
      question: "Какой прибор чаще всего используется для анализа силы и движения в спортивной биомеханике?",
      options: {
        "A": "ЭКГ-аппарат для мониторинга сердечной активности.",
        "B": "Гироскоп для оценки угловых перемещений.",
        "C": "Электромиограф для регистрации активности мышц.",
        "D": "Видеокамера для записи и анализа движений."
      },
      correctAnswer: "C"
    },
    {
      question: "Основной анатомической структурой, где происходит газообмен между воздухом и кровью, является:",
      options: {
        "A": "Альвеолы.",
        "B": "Бронхи среднего калибра.",
        "C": "Терминальные бронхиолы.",
        "D": "Плевральная полость."
      },
      correctAnswer: "C"
    },
    {
      question: "При утомлении время рефлекса:",
      options: {
        "A": "Укорачивается.",
        "B": "Не изменяется.",
        "C": "Увеличивается.",
        "D": "Изменяется."
      },
      correctAnswer: "C"
    },
    {
      question: "У новорождённого количество костей больше, чем у взрослого, потому что:",
      options: {
        "A": "Кости толще.",
        "B": "Нет суставов.",
        "C": "Отсутствует костный мозг.",
        "D": "Некоторые кости ещё не срослись."
      },
      correctAnswer: "D"
    },
    {
      question: "Основная функция педагогики:",
      options: {
        "A": "Организация соревнований.",
        "B": "Подготовка судей.",
        "C": "Научное обоснование образования.",
        "D": "Медицинский контроль."
      },
      correctAnswer: "C"
    },
    {
      question: "Дидактика — это:",
      options: {
        "A": "Теория спорта.",
        "B": "Теория обучения.",
        "C": "Методика соревнований.",
        "D": "Управление школой."
      },
      correctAnswer: "B"
    },
    {
      question: "Гражданско-патриотическое воспитание формирует:",
      options: {
        "A": "Спортивные навыки.",
        "B": "Физические качества.",
        "C": "Технику.",
        "D": "Чувство ответственности перед обществом."
      },
      correctAnswer: "D"
    },
    {
      question: "Проектное обучение — это:",
      options: {
        "A": "Самостоятельная работа над практической задачей.",
        "B": "Тестирование.",
        "C": "Контрольные работы.",
        "D": "Дисциплина."
      },
      correctAnswer: "A"
    },
    {
      question: "Индивидуальный подход в тренировке — это:",
      options: {
        "A": "Одинаковая нагрузка.",
        "B": "Наказание.",
        "C": "Учёт физических и психологических особенностей спортсмена.",
        "D": "Соревнование."
      },
      correctAnswer: "C"
    },
    {
      question: "Коллектив — это:",
      options: {
        "A": "Случайная группа.",
        "B": "Спортивная команда без цели.",
        "C": "Административная структура.",
        "D": "Группа людей, объединённых общей целью и деятельностью."
      },
      correctAnswer: "D"
    }
  ],
  5: [
    {
      question: "К показателям, характеризующим развитие тела человека, относятся:",
      options: {
        "A": "Показатели спортивных результатов и уровень физической подготовки.",
        "B": "Уровень формирования жизненно необходимых умений и навыков.",
        "C": "Строение тела, здоровье и развитие двигательных качеств.",
        "D": "Уровень формирования спортивных умений и навыков."
      },
      correctAnswer: "C"
    },
    {
      question: "Характеристика системы физического воспитания: организационная основа.",
      options: {
        "A": "Принципы, цель, задачи физического воспитания.",
        "B": "Научно-методическая, программно-нормативная и организационная основа физического воспитания.",
        "C": "Состояние функциональной системы.",
        "D": "Программно-нормативная основа физического воспитания."
      },
      correctAnswer: "B"
    },
    {
      question: "Как называются пути передачи умений, навыков и знаний в общении учителя с учениками:",
      options: {
        "A": "Движения.",
        "B": "Методика обучения.",
        "C": "Обучение.",
        "D": "Метод обучения."
      },
      correctAnswer: "D"
    },
    {
      question: "Сила — это:",
      options: {
        "A": "Способность противостоять воздействию внешней среды.",
        "B": "Один из определяющих видов движения человека, основу которого составляет мышечное усилие.",
        "C": "Воздействие мышечной силой за короткое время.",
        "D": "Способность человека прикладывать большое количество усилий."
      },
      correctAnswer: "D"
    },
    {
      question: "В гандболе на поле разрешено заменить:",
      options: {
        "A": "Можно заменить два раза.",
        "B": "Вообще нельзя заменять.",
        "C": "Можно заменить сколько угодно.",
        "D": "Можно заменить только один раз."
      },
      correctAnswer: "C"
    },
    {
      question: "В этом ходу движение рук и ног чередуется, как при обычной ходьбе. Движение выполняется двумя отталкиваниями палками:",
      options: {
        "A": "Попеременный четырёхшажный ход.",
        "B": "Одновременный одношажный ход.",
        "C": "Коньковый ход.",
        "D": "Попеременный двухшажный ход."
      },
      correctAnswer: "D"
    },
    {
      question: "Передвижение футболиста:",
      options: {
        "A": "Остановка мяча пяткой.",
        "B": "Ходьба, бег, повороты, прыжки.",
        "C": "Удар внешней стороной стопы.",
        "D": "Удар мяча носком."
      },
      correctAnswer: "B"
    },
    {
      question: "Коньки для фигурного катания:",
      options: {
        "A": "Коньки для фигурного катания.",
        "B": "Коньки для хоккея с мячом.",
        "C": "Коньки для хоккея.",
        "D": "Коньки для бега на льду."
      },
      correctAnswer: "A"
    },
    {
      question: "Последний шаг при прыжке в высоту:",
      options: {
        "A": "Три шага.",
        "B": "Короткий шаг.",
        "C": "Прыжок.",
        "D": "Два шага."
      },
      correctAnswer: "B"
    },
    {
      question: "Баскетбольный щит крепится на расстоянии от стойки:",
      options: {
        "A": "140 см.",
        "B": "150 см.",
        "C": "120 см.",
        "D": "130 см."
      },
      correctAnswer: "D"
    },
    {
      question: "Важнейший элемент нападения, непосредственно связывающий защитные действия с атакующими:",
      options: {
        "A": "Передача мяча.",
        "B": "Вводить мяч в игру.",
        "C": "Блокирование мяча.",
        "D": "Перехват мяча."
      },
      correctAnswer: "D"
    },
    {
      question: "Из виса с усилием подняться, перевернуться назад и встать в упор — выполняется:",
      options: {
        "A": "На бревне.",
        "B": "На канате.",
        "C": "На коне.",
        "D": "На перекладине."
      },
      correctAnswer: "D"
    },
    {
      question: "В баскетболе нельзя держать мяч под кольцом команды соперника более:",
      options: {
        "A": "6 секунд.",
        "B": "4 секунд.",
        "C": "3 секунд.",
        "D": "5 секунд."
      },
      correctAnswer: "C"
    },
    {
      question: "Что понимается под экстраполяцией в двигательной деятельности?",
      options: {
        "A": "Повторение строго фиксированной последовательности движений.",
        "B": "Угасание старых двигательных навыков.",
        "C": "Способность нервной системы на основе ранее сформированных временных связей решать новые двигательные задачи.",
        "D": "Генетически предопределённая способность к координации."
      },
      correctAnswer: "C"
    },
    {
      question: "Какой отдел сердца образует основание миокарда?",
      options: {
        "A": "Адипоциты.",
        "B": "Сократительные кардиомиоциты.",
        "C": "Гладкие мышечные клетки.",
        "D": "Адипоциты."
      },
      correctAnswer: "B"
    },
    {
      question: "Какой метод используется для изучения воздействия сил на тело спортсмена?",
      options: {
        "A": "Термография — для исследования тепловых изменений в тканях.",
        "B": "Гидродинамический анализ — для оценки воздействия водных сил в водных видах спорта.",
        "C": "Энергоанализ — для исследования расхода энергии.",
        "D": "Статический и динамический анализ сил — для определения и анализа силы, действующей на тело спортсмена."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое физиологическое изменение дыхательной системы является признаком адаптации к выносливостным нагрузкам?",
      options: {
        "A": "Увеличение жизненной ёмкости лёгких.",
        "B": "Повышение дыхательного коэффициента.",
        "C": "Уменьшение жизненной ёмкости лёгких.",
        "D": "Снижение диффузионной способности лёгких."
      },
      correctAnswer: "A"
    },
    {
      question: "Объём циркулирующей крови у здорового человека от массы тела составляет:",
      options: {
        "A": "10%.",
        "B": "4%.",
        "C": "7%.",
        "D": "2%."
      },
      correctAnswer: "C"
    },
    {
      question: "Закрытие зон роста происходит:",
      options: {
        "A": "В раннем детстве.",
        "B": "В пожилом возрасте.",
        "C": "В период новорождённости.",
        "D": "В подростковом возрасте."
      },
      correctAnswer: "D"
    },
    {
      question: "Образование — это:",
      options: {
        "A": "Принципы и закономерности воспитания.",
        "B": "Возможности и пути обучения.",
        "C": "Процесс усвоения знаний и развития личности.",
        "D": "Воспитательное мероприятие."
      },
      correctAnswer: "C"
    },
    {
      question: "Цель обучения — это:",
      options: {
        "A": "Контроль знаний.",
        "B": "Планируемый результат развития личности.",
        "C": "Соревнование.",
        "D": "Отчёт."
      },
      correctAnswer: "B"
    },
    {
      question: "Методы воспитания — это:",
      options: {
        "A": "Спортивные упражнения.",
        "B": "Нормативы.",
        "C": "Тесты.",
        "D": "Способы педагогического воздействия."
      },
      correctAnswer: "D"
    },
    {
      question: "Инклюзивное образование — это:",
      options: {
        "A": "Совместное обучение всех детей.",
        "B": "Раздельное обучение.",
        "C": "Дистанционное.",
        "D": "Элитное."
      },
      correctAnswer: "A"
    },
    {
      question: "Мотивация спортсмена — это:",
      options: {
        "A": "Контроль.",
        "B": "Наказание.",
        "C": "Побуждение к достижению результата.",
        "D": "Отдых."
      },
      correctAnswer: "C"
    },
    {
      question: "Лидерство педагога проявляется в:",
      options: {
        "A": "Авторитарном управлении.",
        "B": "Наказаниях.",
        "C": "Контроле.",
        "D": "Умении оказывать влияние на коллектив."
      },
      correctAnswer: "D"
    }
  ],
  6: [
    {
      question: "Как называется понятие в системе освоения умений и навыков — эффективное управление своими способностями в педагогическом процессе:",
      options: {
        "A": "Физическое воспитание.",
        "B": "Физическое развитие.",
        "C": "Знания физического воспитания.",
        "D": "Физическая культура."
      },
      correctAnswer: "C"
    },
    {
      question: "Физическое воспитание реализуется на основе государственной программы физической культуры и спорта:",
      options: {
        "A": "Разрядные нормы и требования видов спорта.",
        "B": "Задачи, научно обоснованные средства физического воспитания, комплексные.",
        "C": "Методика занятий физическим воспитанием.",
        "D": "Общие социально-педагогические принципы системы физического воспитания."
      },
      correctAnswer: "B"
    },
    {
      question: "К специальным методам физического воспитания относятся:",
      options: {
        "A": "Словесное воздействие, наглядность и практика.",
        "B": "Метод срочной информации.",
        "C": "Практика, телевидение, самостоятельная работа, наблюдение.",
        "D": "Методы строго регламентированных упражнений, игровой и соревновательный методы."
      },
      correctAnswer: "D"
    },
    {
      question: "Абсолютная сила — это: возникающая в двигательном действии, не зависящая от веса человека.",
      options: {
        "A": "Максимальная сила — проявляется при приложении всей силы человека.",
        "B": "Способность человека преодолевать внешние сопротивления.",
        "C": "Максимальное проявление силы мышц в статическом режиме.",
        "D": "Сила, возникающая от произвольной активности человека."
      },
      correctAnswer: "A"
    },
    {
      question: "При спуске по канату сверху вниз:",
      options: {
        "A": "Держаться одной рукой, скользить двумя ногами вниз.",
        "B": "Зажать правой рукой, скользить двумя ногами вниз.",
        "C": "Держаться поочерёдно двумя руками, опираясь двумя ногами, спускаться.",
        "D": "Зажать двумя руками, скользить вниз."
      },
      correctAnswer: "C"
    },
    {
      question: "Место подачи в волейболе:",
      options: {
        "A": "С площадки соперника.",
        "B": "С любого места площадки.",
        "C": "От средней линии.",
        "D": "Стоя лицом к сетке."
      },
      correctAnswer: "D"
    },
    {
      question: "Девочкам нельзя прыгать через скакалку непрерывно подряд более:",
      options: {
        "A": "90–100 раз.",
        "B": "40–60 раз.",
        "C": "70–80 раз.",
        "D": "110–120 раз."
      },
      correctAnswer: "A"
    },
    {
      question: "Возраст мальчиков, для которых высота сетки в волейболе составляет 2 м 35 см:",
      options: {
        "A": "15–16 лет.",
        "B": "19–20 лет.",
        "C": "13–14 лет.",
        "D": "17–18 лет."
      },
      correctAnswer: "A"
    },
    {
      question: "Основные группы подвижных игр:",
      options: {
        "A": "Эстафетные игры.",
        "B": "Соревновательные, ролевые и эстафетные.",
        "C": "Индивидуальные и групповые.",
        "D": "Соревновательные и логические игры."
      },
      correctAnswer: "B"
    },
    {
      question: "К плаванию и нырянию относятся:",
      options: {
        "A": "Спортивное плавание.",
        "B": "Вольный стиль, плавание на спине.",
        "C": "Прикладное плавание.",
        "D": "Прыжки с вышки."
      },
      correctAnswer: "C"
    },
    {
      question: "Действие «либеро» в волейболе:",
      options: {
        "A": "Защитник, играющий на задней линии.",
        "B": "Действует в блокировании.",
        "C": "Нападающий игрок.",
        "D": "Играет на передней линии."
      },
      correctAnswer: "A"
    },
    {
      question: "Рекордные показатели пловцов на дистанциях от 25 до 1500 метров установлены этим видом плавания:",
      options: {
        "A": "Плавание на спине.",
        "B": "Брасс.",
        "C": "Дельфин.",
        "D": "Кроль."
      },
      correctAnswer: "D"
    },
    {
      question: "Радиус трёхочковой дуги в баскетболе:",
      options: {
        "A": "6,20.",
        "B": "5,25.",
        "C": "6,30.",
        "D": "6,25."
      },
      correctAnswer: "D"
    },
    {
      question: "Почему фосфатная система ресинтеза АТФ называется анаэробной и алактатной?",
      options: {
        "A": "Требует минимального количества кислорода и образует мало лактата.",
        "B": "Использует исключительно жиры как источник энергии.",
        "C": "Не требует кислорода и не сопровождается образованием молочной кислоты.",
        "D": "Связана с накоплением лактата в мышцах."
      },
      correctAnswer: "C"
    },
    {
      question: "Какие факторы или вещества тренируют центральные кроветворные органы?",
      options: {
        "A": "Миндалины.",
        "B": "Тимус.",
        "C": "Селезёнка.",
        "D": "Печень."
      },
      correctAnswer: "B"
    },
    {
      question: "Что включает в себя метод кинематического анализа в спортивной биомеханике?",
      options: {
        "A": "Оценку сил, действующих на тело.",
        "B": "Регистрацию электрической активности мышц.",
        "C": "Прогнозирование травм.",
        "D": "Измерение перемещений, скоростей и ускорений."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое утверждение наиболее точно отражает роль диафрагмы в акте дыхания?",
      options: {
        "A": "Является основной дыхательной мышцей при вдохе.",
        "B": "Участвует только в форсированном вдохе.",
        "C": "Обеспечивает пассивный выдох.",
        "D": "Работает только при физической нагрузке."
      },
      correctAnswer: "A"
    },
    {
      question: "Гематокрит — это:",
      options: {
        "A": "Плотный осадок крови.",
        "B": "Цветовой показатель крови.",
        "C": "Процентное соотношение объёма красных кровяных клеток (эритроцитов) к общему объёму крови.",
        "D": "Все элементы крови."
      },
      correctAnswer: "C"
    },
    {
      question: "У детей костная ткань:",
      options: {
        "A": "Более хрупкая.",
        "B": "Не содержит органических веществ.",
        "C": "Не имеет надкостницы.",
        "D": "Более эластичная."
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогический процесс — это:",
      options: {
        "A": "Возможности и пути обучения.",
        "B": "Методы тренировки.",
        "C": "Целостная система обучения и воспитания.",
        "D": "Контроль знаний."
      },
      correctAnswer: "C"
    },
    {
      question: "Компетентностный подход предполагает:",
      options: {
        "A": "Заучивание текста.",
        "B": "Формирование практических умений и навыков.",
        "C": "Контроль дисциплины.",
        "D": "Увеличение нагрузки."
      },
      correctAnswer: "B"
    },
    {
      question: "Самовоспитание — это:",
      options: {
        "A": "Наказание.",
        "B": "Контроль.",
        "C": "Экзамен.",
        "D": "Сознательная работа личности над собой."
      },
      correctAnswer: "D"
    },
    {
      question: "Дети с ООП — это:",
      options: {
        "A": "Обучающиеся с особыми образовательными потребностями.",
        "B": "Только спортсмены.",
        "C": "Отличники.",
        "D": "Нарушители дисциплины."
      },
      correctAnswer: "A"
    },
    {
      question: "Воспитательный потенциал спорта заключается в:",
      options: {
        "A": "Только физическом развитии.",
        "B": "Контроле.",
        "C": "Формировании дисциплины и ответственности.",
        "D": "Отчётности."
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогическая культура — это:",
      options: {
        "A": "Стаж работы.",
        "B": "Внешний вид.",
        "C": "Должность.",
        "D": "Совокупность профессиональных знаний, умений и ценностей."
      },
      correctAnswer: "D"
    }
  ],
  7: [
    {
      question: "Как называется совокупность достижений общества, направленная на совершенствование тела человека, эффективное использование средств и методов:",
      options: {
        "A": "Спорт.",
        "B": "База физической культуры.",
        "C": "Физическая культура.",
        "D": "Адаптивная физическая культура."
      },
      correctAnswer: "C"
    },
    {
      question: "Проявление знаний в физической культуре и спорте: передача.",
      options: {
        "A": "Формирование спортивных и специальных физкультурных знаний.",
        "B": "Передача учащимся двигательных умений и навыков, а также знаний.",
        "C": "Разностороннее развитие формы и функции организма человека.",
        "D": "Разностороннее развитие личности."
      },
      correctAnswer: "B"
    },
    {
      question: "Какой метод используется при выполнении непрерывных и интервальных упражнений?",
      options: {
        "A": "Метод сопряжённого воздействия.",
        "B": "Игровой метод.",
        "C": "Переменно-непрерывный метод упражнений.",
        "D": "Круговой метод."
      },
      correctAnswer: "D"
    },
    {
      question: "Относительная сила — это:",
      options: {
        "A": "Сила, рассчитанная на 1 кг веса человека.",
        "B": "Сравнение силы одного человека с силой другого.",
        "C": "Сила на 1 см² поперечного сечения мышцы.",
        "D": "Сравнение одного упражнения с другим."
      },
      correctAnswer: "A"
    },
    {
      question: "Высота подъёма по канату со смешанным хватом тремя способами с учётом времени (для девочек):",
      options: {
        "A": "2 метра.",
        "B": "5 метров.",
        "C": "3 метра.",
        "D": "4 метра."
      },
      correctAnswer: "C"
    },
    {
      question: "Главная цель нападающего в футболе:",
      options: {
        "A": "Держать мяч, защищаться.",
        "B": "Обманывать соперника.",
        "C": "Соблюдать правила игры.",
        "D": "Забить мяч в ворота."
      },
      correctAnswer: "D"
    },
    {
      question: "Ошибка игрока с мячом в баскетболе при прыжке:",
      options: {
        "A": "Прыгнуть и бросить мяч в кольцо двумя руками от груди.",
        "B": "Прыгнуть и приземлиться с мячом снова.",
        "C": "Прыгнуть и отдать мяч партнёру одной рукой с плеча.",
        "D": "Прыгнуть и бросить мяч в кольцо одной рукой."
      },
      correctAnswer: "B"
    },
    {
      question: "Возраст девочек, для которых высота сетки в волейболе составляет 2 м 20 см:",
      options: {
        "A": "15–16 лет.",
        "B": "17–18 лет.",
        "C": "13–14 лет.",
        "D": "19–20 лет."
      },
      correctAnswer: "A"
    },
    {
      question: "Команда для перестроения из одной шеренги в две:",
      options: {
        "A": "Встать в две шеренги.",
        "B": "Встать в две колонны.",
        "C": "Встать в два ряда.",
        "D": "Встать в строй."
      },
      correctAnswer: "B"
    },
    {
      question: "Перед прыжком в длину с разбега:",
      options: {
        "A": "Следить за тем, чтобы снаряды не ржавели.",
        "B": "Ставить снаряды на дорожку для бега.",
        "C": "Разрыхлить песок в яме.",
        "D": "Тщательно проверить крепление снарядов."
      },
      correctAnswer: "C"
    },
    {
      question: "Позиционные номера, стоящие на передней линии в волейболе:",
      options: {
        "A": "2, 3, 4.",
        "B": "1, 2, 3.",
        "C": "1, 5, 6.",
        "D": "2, 4, 6."
      },
      correctAnswer: "A"
    },
    {
      question: "Минимальная глубина воды для прыжка с высоты 1 метр:",
      options: {
        "A": "1 метр.",
        "B": "3 метра.",
        "C": "1,5 метра.",
        "D": "2 метра."
      },
      correctAnswer: "B"
    },
    {
      question: "Действие «либеро» в волейболе:",
      options: {
        "A": "Защитник, играющий на задней линии.",
        "B": "Действует в блокировании.",
        "C": "Нападающий игрок.",
        "D": "Играет на передней линии."
      },
      correctAnswer: "A"
    },
    {
      question: "Почему кровь является одним из наиболее информативных объектов биохимического исследования в спорте?",
      options: {
        "A": "Потому что её проще всего получить.",
        "B": "Кровь изменяется только при заболеваниях.",
        "C": "В крови отражаются метаболические изменения, происходящие в тканях и внутренней среде организма.",
        "D": "Она характеризует исключительно состояние сердечно-сосудистой системы."
      },
      correctAnswer: "C"
    },
    {
      question: "Где находится жёлтый костный мозг?",
      options: {
        "A": "В рёберных костях.",
        "B": "В диафизе трубчатых костей.",
        "C": "В эпифизе трубчатых костей.",
        "D": "В костях позвоночника."
      },
      correctAnswer: "C"
    },
    {
      question: "Что измеряет электрическая тензометрия?",
      options: {
        "A": "Изменение температуры в организме.",
        "B": "Электрическую активность мышц.",
        "C": "Скорость движения тела.",
        "D": "Деформацию поверхности тела."
      },
      correctAnswer: "D"
    },
    {
      question: "Какой дыхательный тест наиболее информативен для оценки функционального состояния внешнего дыхания у спортсменов выносливостных видов спорта?",
      options: {
        "A": "Спирометрия (ЖЁЛ, ФЖЁЛ).",
        "B": "Частота дыхания в покое.",
        "C": "Проба с максимальной задержкой дыхания.",
        "D": "Экскурсия грудной клетки."
      },
      correctAnswer: "A"
    },
    {
      question: "При спокойном выдохе грудная клетка уменьшается:",
      options: {
        "A": "За счёт сокращения мышц брюшного пресса.",
        "B": "За счёт сокращения мышц шеи.",
        "C": "За счёт сокращения межрёберных мышц и диафрагмы.",
        "D": "За счёт мышц живота."
      },
      correctAnswer: "C"
    },
    {
      question: "Формирование изгибов позвоночника завершается:",
      options: {
        "A": "К 1 году.",
        "B": "К 3 годам.",
        "C": "К 7 годам.",
        "D": "К подростковому возрасту."
      },
      correctAnswer: "D"
    },
    {
      question: "Закономерности педагогического процесса отражают:",
      options: {
        "A": "Случайные явления.",
        "B": "Требования администрации.",
        "C": "Устойчивые связи между его компонентами.",
        "D": "Расписание занятий."
      },
      correctAnswer: "C"
    },
    {
      question: "Метод обучения — это:",
      options: {
        "A": "Расписание.",
        "B": "Способ совместной деятельности учителя и ученика.",
        "C": "Отчёт.",
        "D": "Форма контроля."
      },
      correctAnswer: "B"
    },
    {
      question: "Профессиональная компетентность — это:",
      options: {
        "A": "Стаж работы.",
        "B": "Получение диплома.",
        "C": "Участие в соревнованиях.",
        "D": "Совокупность знаний, умений и личных качеств."
      },
      correctAnswer: "D"
    },
    {
      question: "Адаптация программы предполагает:",
      options: {
        "A": "Изменение содержания с учётом возможностей ребёнка.",
        "B": "Отмену обучения.",
        "C": "Снижение требований.",
        "D": "Дополнение знаний обучающихся."
      },
      correctAnswer: "A"
    },
    {
      question: "Самоанализ тренера — это:",
      options: {
        "A": "Контроль спортсменов.",
        "B": "Соревнование.",
        "C": "Оценка собственной профессиональной деятельности.",
        "D": "Экзамен."
      },
      correctAnswer: "C"
    },
    {
      question: "Этика педагога — это:",
      options: {
        "A": "Правила соревнований.",
        "B": "Метод обучения.",
        "C": "Форма контроля.",
        "D": "Нормы профессионального поведения."
      },
      correctAnswer: "D"
    }
  ],
  8: [
    {
      question: "Оздоровительно-реабилитационная физическая культура — это:",
      options: {
        "A": "В сфере организации досуга.",
        "B": "На уроке физкультуры в школе.",
        "C": "В системе социальной реабилитации.",
        "D": "В спортивной тренировке."
      },
      correctAnswer: "C"
    },
    {
      question: "Укажите общеметодический принцип из перечисленных:",
      options: {
        "A": "Принцип непрерывности, систематическое чередование нагрузок и отдыха.",
        "B": "Сознательность и активность, наглядность, доступность и индивидуализация.",
        "C": "Динамическое равновесие нагрузки и адаптации, циклическое построение занятий.",
        "D": "Принцип развития — постепенного наращивания тренировочных воздействий, направленности физического воспитания."
      },
      correctAnswer: "B"
    },
    {
      question: "К каким общепедагогическим методам относится физическое воспитание:",
      options: {
        "A": "Метод строго регламентированных упражнений, игровой и соревновательный методы.",
        "B": "Метод ускоренного информирования.",
        "C": "Практика, телевидение, самостоятельная работа, наблюдение, самоанализ.",
        "D": "Метод словесного воздействия и метод наглядности."
      },
      correctAnswer: "B"
    },
    {
      question: "Каким методом можно определить нагрузку на тренировочном занятии:",
      options: {
        "A": "Пульсометрия.",
        "B": "Педагогический анализ.",
        "C": "Хронометраж.",
        "D": "Педагогическое наблюдение."
      },
      correctAnswer: "D"
    },
    {
      question: "Количество игроков в одной команде на поле в баскетболе:",
      options: {
        "A": "6.",
        "B": "4.",
        "C": "5.",
        "D": "7."
      },
      correctAnswer: "A"
    },
    {
      question: "Расположение учащихся один за другим:",
      options: {
        "A": "Шеренга.",
        "B": "Круг.",
        "C": "Ряд.",
        "D": "Колонна."
      },
      correctAnswer: "C"
    },
    {
      question: "Техника передвижения (гандбол):",
      options: {
        "A": "Ловля.",
        "B": "Повороты.",
        "C": "Отбивание.",
        "D": "Бросок."
      },
      correctAnswer: "D"
    },
    {
      question: "В каком возрасте у девочек в волейболе высота сетки 2 м 24 см:",
      options: {
        "A": "17–18 лет.",
        "B": "13–14 лет.",
        "C": "15–16 лет.",
        "D": "11–12 лет."
      },
      correctAnswer: "B"
    },
    {
      question: "Движение человека в пространстве за определённый промежуток времени:",
      options: {
        "A": "Сила.",
        "B": "Скорость.",
        "C": "Выносливость.",
        "D": "Ловкость."
      },
      correctAnswer: "C"
    },
    {
      question: "Время владения мячом игрока в гандболе:",
      options: {
        "A": "7 секунд.",
        "B": "9 секунд.",
        "C": "3 секунды.",
        "D": "5 секунд."
      },
      correctAnswer: "B"
    },
    {
      question: "Классический лыжный ход:",
      options: {
        "A": "Попеременный двухшажный.",
        "B": "Беговой шаг.",
        "C": "Ход без лыж.",
        "D": "Двухшажный одновременный."
      },
      correctAnswer: "C"
    },
    {
      question: "Баскетбольная игра состоит из периодов:",
      options: {
        "A": "3.",
        "B": "2.",
        "C": "1.",
        "D": "4."
      },
      correctAnswer: "A"
    },
    {
      question: "Характеристика системы физического воспитания: организационная основа.",
      options: {
        "A": "Принципы, цель, задачи физического воспитания.",
        "B": "Научно-методическая, программно-нормативная и организационная основа физического воспитания.",
        "C": "Состояние функциональной системы.",
        "D": "Программно-нормативная основа физического воспитания."
      },
      correctAnswer: "D"
    },
    {
      question: "Почему дегидратация особенно опасна при физических нагрузках?",
      options: {
        "A": "Потому что влияет только на работу дыхательной системы.",
        "B": "Потому что усиливает синтез АТФ.",
        "C": "Поскольку вода участвует в терморегуляции, транспорте питательных веществ и выведении продуктов обмена.",
        "D": "Так как повышает эластичность мышц."
      },
      correctAnswer: "C"
    },
    {
      question: "Какой орган относится к центральной эндокринной системе?",
      options: {
        "A": "Щитовидная железа.",
        "B": "Гипоталамус.",
        "C": "Надпочечники.",
        "D": "Двойная щитовидная железа."
      },
      correctAnswer: "B"
    },
    {
      question: "Какие движения можно проанализировать с помощью вектординамографии?",
      options: {
        "A": "Колебания тела в покое.",
        "B": "Напряжение мышц.",
        "C": "Амплитуду колебаний.",
        "D": "Направление и силу движений."
      },
      correctAnswer: "D"
    },
    {
      question: "Если при нагрузочном тесте у спортсмена наблюдается рост минутного объёма дыхания без увеличения альвеолярной вентиляции, это указывает на:",
      options: {
        "A": "Увеличение «мёртвого пространства».",
        "B": "Высокую эффективность дыхательной системы.",
        "C": "Оптимальную регуляцию дыхания.",
        "D": "Адаптацию к аэробной работе."
      },
      correctAnswer: "A"
    },
    {
      question: "Малый круг кровообращения начинается:",
      options: {
        "A": "Аортой.",
        "B": "Полой веной.",
        "C": "Лёгочным стволом.",
        "D": "Капиллярами."
      },
      correctAnswer: "C"
    },
    {
      question: "В пожилом возрасте чаще развивается:",
      options: {
        "A": "Гипертрофия.",
        "B": "Сколиоз.",
        "C": "Миозит.",
        "D": "Остеопороз."
      },
      correctAnswer: "D"
    },
    {
      question: "Принцип гуманизации предполагает:",
      options: {
        "A": "Строгую дисциплину.",
        "B": "Наказание.",
        "C": "Уважение к личности обучающегося.",
        "D": "Контроль."
      },
      correctAnswer: "C"
    },
    {
      question: "Активные методы обучения предполагают:",
      options: {
        "A": "Пассивное слушание.",
        "B": "Участие обучающихся в познавательной деятельности.",
        "C": "Наказание.",
        "D": "Контроль."
      },
      correctAnswer: "B"
    },
    {
      question: "Педагогическое мастерство — это:",
      options: {
        "A": "Применение методов воспитания.",
        "B": "Усиление методов контроля.",
        "C": "Частое применение методов наказания.",
        "D": "Высокий уровень профессиональной деятельности."
      },
      correctAnswer: "D"
    },
    {
      question: "Инклюзивная культура — это:",
      options: {
        "A": "Уважение и принятие разнообразия.",
        "B": "Соревнование.",
        "C": "Контроль.",
        "D": "Изоляция."
      },
      correctAnswer: "A"
    },
    {
      question: "Принцип систематичности означает:",
      options: {
        "A": "Проведение занятий по желанию.",
        "B": "Эпизодический характер обучения.",
        "C": "Регулярность и последовательность педагогической работы.",
        "D": "Увеличение нагрузки."
      },
      correctAnswer: "C"
    },
    {
      question: "Конфликт — это:",
      options: {
        "A": "Соревнование.",
        "B": "Дискуссия.",
        "C": "Сотрудничество.",
        "D": "Столкновение противоположных интересов."
      },
      correctAnswer: "D"
    }
  ],
  9: [
    {
      question: "Как называется применение принципов мировоззрения и методов познания в философии, изменение бытия:",
      options: {
        "A": "Методология.",
        "B": "Методологический подход.",
        "C": "Методология.",
        "D": "Метод."
      },
      correctAnswer: "C"
    },
    {
      question: "Какой принцип предусматривает эффективные задания, средства и методы физического воспитания в соответствии с возможностями занимающихся:",
      options: {
        "A": "Принцип сознательности и активности.",
        "B": "Принцип доступности и индивидуализации.",
        "C": "Принцип научности.",
        "D": "Принцип связи теории с практикой."
      },
      correctAnswer: "B"
    },
    {
      question: "Каким социальным субъектом осуществляется целенаправленный, систематический процесс формирования и развития:",
      options: {
        "A": "Учёба.",
        "B": "Обучение.",
        "C": "Воспитание.",
        "D": "Тренировка."
      },
      correctAnswer: "C"
    },
    {
      question: "К чему относится подъём лёгкого веса до утомления:",
      options: {
        "A": "Метод воспитания силы «выносливость».",
        "B": "Метод воспитания силы «интенсивность».",
        "C": "Воспитание «взрывной» силы мышц.",
        "D": "Воспитание мышечной силы в режиме «уступания»."
      },
      correctAnswer: "A"
    },
    {
      question: "Этот метод применяется при подъёме на крутой склон:",
      options: {
        "A": "Полуёлочкой.",
        "B": "Плугом.",
        "C": "Лесенкой.",
        "D": "Ёлочкой."
      },
      correctAnswer: "C"
    },
    {
      question: "Лёжа в воде на груди, гребёт двумя руками, затем толчок назад. Руки и ноги работают одновременно:",
      options: {
        "A": "Брасс.",
        "B": "Кроль.",
        "C": "Плавание на спине.",
        "D": "Дельфин."
      },
      correctAnswer: "A"
    },
    {
      question: "На месте повороты, повороты направо, кругом направо, налево, кругом налево, равновесие на одной ноге — выполняются:",
      options: {
        "A": "На канате.",
        "B": "На бревне.",
        "C": "На перекладине.",
        "D": "На шесте."
      },
      correctAnswer: "A"
    },
    {
      question: "Возраст мальчиков, для которых высота сетки в волейболе составляет 2 м 43 см:",
      options: {
        "A": "17–18 лет.",
        "B": "13–14 лет.",
        "C": "15–16 лет.",
        "D": "11–12 лет."
      },
      correctAnswer: "A"
    },
    {
      question: "Подразделение строевых упражнений: бег, рассыпной строй и уплотнение:",
      options: {
        "A": "Вставание в строй и перестроение, ходьба и бег, прыжки.",
        "B": "Строевые приёмы, вставание в строй и перестроение, ходьба и бег.",
        "C": "Строевые приёмы, вставание в строй и перестроение, бег.",
        "D": "Строевые приёмы, перестроение строя, ходьба, прыжки."
      },
      correctAnswer: "A"
    },
    {
      question: "Условия безопасности на подвижных играх:",
      options: {
        "A": "Нападать на соперника.",
        "B": "Только быстро играть.",
        "C": "Выполнять инструкцию.",
        "D": "Игнорировать правила игры."
      },
      correctAnswer: "B"
    },
    {
      question: "Методы подъёма в гору:",
      options: {
        "A": "Ёлочкой.",
        "B": "Опорный метод.",
        "C": "Прыжками на двух ногах.",
        "D": "Плугом."
      },
      correctAnswer: "C"
    },
    {
      question: "Состав игроков волейбольной команды:",
      options: {
        "A": "11 игроков (5 запасных, 6 основных).",
        "B": "16 игроков (6 основных, 10 запасных).",
        "C": "14 игроков (6 основных, 8 запасных).",
        "D": "12 игроков (6 запасных, 6 основных)."
      },
      correctAnswer: "A"
    },
    {
      question: "Приём выполняется с одной ногой впереди, вес тела равномерно распределён на две ноги, грудь слегка наклонена в сторону бросающей руки (гандбол):",
      options: {
        "A": "Передача сверху.",
        "B": "Передача из-за спины.",
        "C": "Передача снизу.",
        "D": "Передача сбоку."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое последствие может возникнуть даже при незначительной дегидратации во время физической нагрузки?",
      options: {
        "A": "Повышение аэробной производительности.",
        "B": "Улучшение координации движений.",
        "C": "Снижение выносливости и работоспособности.",
        "D": "Ускорение процессов восстановления."
      },
      correctAnswer: "C"
    },
    {
      question: "Какая система постоянно регулирует деятельность эндокринных желёз?",
      options: {
        "A": "Пищеварение.",
        "B": "Нервная.",
        "C": "Дыхание.",
        "D": "Нервная."
      },
      correctAnswer: "B"
    },
    {
      question: "Какой из законов объясняет, почему тело сохраняет состояние покоя или равномерного движения, пока на него не подействует сила?",
      options: {
        "A": "Второй закон Ньютона.",
        "B": "Закон сохранения импульса.",
        "C": "Закон сохранения энергии.",
        "D": "Первый закон Ньютона."
      },
      correctAnswer: "D"
    },
    {
      question: "У спортсмена ЧСС в покое — 48 уд/мин. После стандартной нагрузки пульс восстанавливается до исходного уровня за 2 минуты. Это свидетельствует о:",
      options: {
        "A": "Высоком уровне функционального состояния сердечно-сосудистой системы.",
        "B": "Недостаточной тренированности, нарушении ритма.",
        "C": "Нарушении регуляции сердечного ритма.",
        "D": "Патологической брадикардии, снижении артериального давления."
      },
      correctAnswer: "A"
    },
    {
      question: "Сколько составляет объём литров крови у взрослого человека?",
      options: {
        "A": "3 литра.",
        "B": "6 литров.",
        "C": "5 литров.",
        "D": "2 литра."
      },
      correctAnswer: "C"
    },
    {
      question: "При регулярных нагрузках мышцы:",
      options: {
        "A": "Атрофируются.",
        "B": "Уменьшаются.",
        "C": "Теряют эластичность.",
        "D": "Гипертрофируются."
      },
      correctAnswer: "D"
    },
    {
      question: "Социализация — это:",
      options: {
        "A": "Спортивная подготовка.",
        "B": "Аттестация.",
        "C": "Усвоение социальных норм и ценностей.",
        "D": "Соревнование."
      },
      correctAnswer: "C"
    },
    {
      question: "Урок — это:",
      options: {
        "A": "Соревнование.",
        "B": "Основная форма организации обучения.",
        "C": "Факультатив.",
        "D": "Семинар."
      },
      correctAnswer: "B"
    },
    {
      question: "Педагогическое общение — это:",
      options: {
        "A": "Работа с родителями.",
        "B": "Привлечение обучающихся к участию в соревнованиях.",
        "C": "Частое использование методов контроля.",
        "D": "Профессиональное взаимодействие педагога и обучающихся."
      },
      correctAnswer: "D"
    },
    {
      question: "Роль педагога в инклюзии — это:",
      options: {
        "A": "Создание благоприятной среды для всех.",
        "B": "Контроль.",
        "C": "Дисциплина.",
        "D": "Оценивание."
      },
      correctAnswer: "A"
    },
    {
      question: "Принцип наглядности предполагает:",
      options: {
        "A": "Устное объяснение без примеров.",
        "B": "Контроль знаний.",
        "C": "Использование визуальных средств и демонстраций.",
        "D": "Самостоятельную работу."
      },
      correctAnswer: "C"
    },
    {
      question: "Разрешение конфликта предполагает:",
      options: {
        "A": "Игнорирование.",
        "B": "Наказание.",
        "C": "Давление.",
        "D": "Конструктивный диалог и поиск компромисса."
      },
      correctAnswer: "D"
    }
  ],
  10: [
    {
      question: "Как называется совокупность видов научной работы в физической культуре и спорте:",
      options: {
        "A": "Метод.",
        "B": "Методологический подход.",
        "C": "Методология.",
        "D": "Закономерность."
      },
      correctAnswer: "C"
    },
    {
      question: "Какой принцип предусматривает планомерное увеличение объёма и интенсивности нагрузки по мере роста уровня функционирования организма:",
      options: {
        "A": "Принцип научности.",
        "B": "Принцип постепенного наращивания и развития нагрузки.",
        "C": "Принцип доступности и индивидуализации.",
        "D": "Принцип непрерывности."
      },
      correctAnswer: "B"
    },
    {
      question: "Найди правильный образец освоения двигательного действия:",
      options: {
        "A": "Умение — до умения — навык.",
        "B": "Навык — умение — до умения.",
        "C": "Навык — до умения — умение.",
        "D": "До умения — умение — навык."
      },
      correctAnswer: "D"
    },
    {
      question: "В каком возрасте наблюдается интенсивный рост абсолютной силы в группах мышц:",
      options: {
        "A": "Старшеклассники 16–18 лет.",
        "B": "Дошкольники 5–6 лет.",
        "C": "Учащиеся начальных классов 9–11 лет.",
        "D": "Учащиеся средних классов 12–15 лет."
      },
      correctAnswer: "A"
    },
    {
      question: "Если в воде тело охладилось и стало холодно:",
      options: {
        "A": "Высунуть только голову из воды.",
        "B": "Быстро нырнуть.",
        "C": "Выйти из воды и выполнить упражнения.",
        "D": "Выполнять упражнения в воде."
      },
      correctAnswer: "C"
    },
    {
      question: "Ввод мяча с центра в футболе определяется:",
      options: {
        "A": "Капитанами команд.",
        "B": "Болельщики определяют.",
        "C": "Штрафным ударом.",
        "D": "Жеребьёвкой."
      },
      correctAnswer: "D"
    },
    {
      question: "В этом способе подъёма одна лыжа направлена прямо вверх, а носок другой лыжи направлен наружу:",
      options: {
        "A": "Лесенкой.",
        "B": "Полуёлочкой.",
        "C": "Плугом.",
        "D": "Ёлочкой."
      },
      correctAnswer: "B"
    },
    {
      question: "В волейболе линия нападения проводится на расстоянии 3 м от средней линии:",
      options: {
        "A": "Линия нападения.",
        "B": "Зона подачи.",
        "C": "Зона защиты.",
        "D": "Свободная зона."
      },
      correctAnswer: "A"
    },
    {
      question: "Лёжа на спине, энергично поднять ноги вверх, поддерживая поясницу руками, опираясь на локти:",
      options: {
        "A": "Мост.",
        "B": "Стойка на лопатках.",
        "C": "Перекат вперёд.",
        "D": "Перекат назад."
      },
      correctAnswer: "A"
    },
    {
      question: "Высота подъёма по канату со смешанным хватом тремя способами с учётом времени (для мальчиков):",
      options: {
        "A": "2 метра.",
        "B": "5 метров.",
        "C": "4 метра.",
        "D": "3 метра."
      },
      correctAnswer: "B"
    },
    {
      question: "Способ торможения в лыжном спорте:",
      options: {
        "A": "Плугом.",
        "B": "Лесенкой.",
        "C": "Полуёлочкой.",
        "D": "Ёлочкой."
      },
      correctAnswer: "D"
    },
    {
      question: "Кто изобрёл гандбол?",
      options: {
        "A": "Леонардо да Винчи.",
        "B": "Дэвид Блоутон.",
        "C": "Джеймс Нейсмит.",
        "D": "Хольгер Нильсен."
      },
      correctAnswer: "A"
    },
    {
      question: "Возраст мальчиков, для которых высота сетки в волейболе составляет 2 м 35 см:",
      options: {
        "A": "15–16 лет.",
        "B": "19–20 лет.",
        "C": "13–14 лет.",
        "D": "17–18 лет."
      },
      correctAnswer: "D"
    },
    {
      question: "Какова одна из ключевых функций электролитов в организме?",
      options: {
        "A": "Обеспечение синтеза АТФ в митохондриях.",
        "B": "Регуляция исключительно белкового обмена.",
        "C": "Поддержание водного баланса клеток.",
        "D": "Формирование костной ткани."
      },
      correctAnswer: "C"
    },
    {
      question: "В волокнистой хрящевой оболочке какого органа дыхательной системы имеется 16–20 гиалиново-хрящевых полуколец:",
      options: {
        "A": "Гортань.",
        "B": "Трахея.",
        "C": "Главный бронх.",
        "D": "Крупный бронх."
      },
      correctAnswer: "B"
    },
    {
      question: "Какую энергию использует спортсмен, чтобы подняться в прыжке в высоту?",
      options: {
        "A": "Тепловую энергию.",
        "B": "Электрическую энергию.",
        "C": "Потенциальную энергию.",
        "D": "Кинетическую энергию."
      },
      correctAnswer: "D"
    },
    {
      question: "Какое анатомо-топографическое различие между правым и левым лёгким является правильным?",
      options: {
        "A": "Правое лёгкое короче и шире левого.",
        "B": "Правое лёгкое имеет две доли, левое — три.",
        "C": "Левое лёгкое шире правого.",
        "D": "Левое лёгкое не участвует в дыхании."
      },
      correctAnswer: "A"
    },
    {
      question: "За сутки человек должен употреблять углеводов в граммах:",
      options: {
        "A": "100.",
        "B": "800.",
        "C": "400.",
        "D": "550."
      },
      correctAnswer: "C"
    },
    {
      question: "Чаще всего у спортсменов травмируются:",
      options: {
        "A": "Надкостница.",
        "B": "Костный мозг.",
        "C": "Копчик.",
        "D": "Связки."
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогическая деятельность — это:",
      options: {
        "A": "Судейство.",
        "B": "Менеджмент.",
        "C": "Профессиональная деятельность по обучению и воспитанию.",
        "D": "Медицинское сопровождение."
      },
      correctAnswer: "C"
    },
    {
      question: "Формирующее оценивание направлено на:",
      options: {
        "A": "Итоговую отметку.",
        "B": "Развитие и поддержку обучающегося.",
        "C": "Наказание.",
        "D": "Отчётность."
      },
      correctAnswer: "B"
    },
    {
      question: "Авторитет педагога основан на:",
      options: {
        "A": "Применении методов воспитания.",
        "B": "Участии с обучающимися в спортивных мероприятиях.",
        "C": "Работе с родителями.",
        "D": "Профессионализме и личном примере."
      },
      correctAnswer: "D"
    },
    {
      question: "Право на образование гарантируется:",
      options: {
        "A": "Законодательством государства.",
        "B": "Школой.",
        "C": "Тренером.",
        "D": "Родителями."
      },
      correctAnswer: "A"
    },
    {
      question: "Принцип доступности означает:",
      options: {
        "A": "Упрощение материала до минимума.",
        "B": "Исключение сложных тем.",
        "C": "Соответствие содержания обучения возрастным и индивидуальным особенностям.",
        "D": "Отсутствие требований."
      },
      correctAnswer: "C"
    },
    {
      question: "Самообразование — это:",
      options: {
        "A": "Контроль.",
        "B": "Отчётность.",
        "C": "Соревнование.",
        "D": "Самостоятельное повышение уровня знаний и квалификации."
      },
      correctAnswer: "D"
    }
  ],
  11: [
    {
      question: "Какой из методов педагогического исследования в физической культуре и спорте считается ведущим:",
      options: {
        "A": "Опрос.",
        "B": "Педагогическое наблюдение.",
        "C": "Педагогический эксперимент.",
        "D": "Хронометраж."
      },
      correctAnswer: "C"
    },
    {
      question: "Физическое упражнение — это:",
      options: {
        "A": "Действие, направленное на формирование умений и навыков тела.",
        "B": "Реализующее задачи физического воспитания с закономерностями.",
        "C": "Действие, направленное на изменение морфофункциональной работы тела.",
        "D": "Действие, направленное на изменение строения тела, двигательных качеств."
      },
      correctAnswer: "B"
    },
    {
      question: "Задача обучения технике движений на начальном этапе:",
      options: {
        "A": "Завершение формирования двигательного умения.",
        "B": "Закрепление и детальное освоение техники движений.",
        "C": "Целостное и детальное освоение фаз разучиваемого движения.",
        "D": "Формирование основы обучения технике движений и её реализация."
      },
      correctAnswer: "C"
    },
    {
      question: "Как называется двигательная возможность человека за небольшой промежуток времени:",
      options: {
        "A": "Скоростная способность.",
        "B": "Двигательная реакция.",
        "C": "Скоростно-силовая способность.",
        "D": "Частота движений."
      },
      correctAnswer: "A"
    },
    {
      question: "Одного из запасных игроков можно заменить только один раз (гандбол):",
      options: {
        "A": "Защитника.",
        "B": "Нападающего.",
        "C": "Вратаря.",
        "D": "Центрального."
      },
      correctAnswer: "C"
    },
    {
      question: "За финишем на беговой дорожке должно быть свободное пространство:",
      options: {
        "A": "4–5 м.",
        "B": "1–2 м.",
        "C": "7–8 м.",
        "D": "12–15 м."
      },
      correctAnswer: "D"
    },
    {
      question: "Правило безопасности при беге на короткие дистанции:",
      options: {
        "A": "Бежать в среднем темпе.",
        "B": "Бежать только по своей дорожке.",
        "C": "Бежать медленно.",
        "D": "Бежать как можно быстрее."
      },
      correctAnswer: "B"
    },
    {
      question: "Наиболее распространённый способ при спуске с горы на лыжах:",
      options: {
        "A": "В среднем приседе.",
        "B": "С поворотом.",
        "C": "Стоя прямо.",
        "D": "В глубоком приседе."
      },
      correctAnswer: "D"
    },
    {
      question: "Высота барьеров в беге на короткие дистанции для мужчин:",
      options: {
        "A": "110,7.",
        "B": "106,7.",
        "C": "91,8.",
        "D": "105,5."
      },
      correctAnswer: "A"
    },
    {
      question: "Длина гимнастической палки для учащихся 11–12 лет:",
      options: {
        "A": "82–84 см.",
        "B": "84–86 см.",
        "C": "78–80 см.",
        "D": "83–85 см."
      },
      correctAnswer: "B"
    },
    {
      question: "Особая дистанция — марафонский бег:",
      options: {
        "A": "42 км 195 м.",
        "B": "43 км 191 м.",
        "C": "41 км 192 м.",
        "D": "40 км 193 м."
      },
      correctAnswer: "A"
    },
    {
      question: "Сколько времени игрок в гандболе может держать мяч:",
      options: {
        "A": "4 секунды.",
        "B": "2 секунды.",
        "C": "1 секунду.",
        "D": "3 секунды."
      },
      correctAnswer: "D"
    },
    {
      question: "Расположение учащихся один за другим:",
      options: {
        "A": "Шеренга.",
        "B": "Круг.",
        "C": "Ряд.",
        "D": "Колонна."
      },
      correctAnswer: "D"
    },
    {
      question: "Основной причиной мышечной усталости при длительном беге в высоком темпе является:",
      options: {
        "A": "Снижение температуры мышц.",
        "B": "Повышение уровня гликогена.",
        "C": "Рост концентрации лактата в крови и мышцах.",
        "D": "Усиление аэробных процессов."
      },
      correctAnswer: "C"
    },
    {
      question: "Какие заболевания относятся к респираторным:",
      options: {
        "A": "Серозит.",
        "B": "Туберкулёз.",
        "C": "Атеросклероз.",
        "D": "Рахит."
      },
      correctAnswer: "B"
    },
    {
      question: "В каком виде спорта особенно важна роль силы трения для управления движением объекта?",
      options: {
        "A": "Лыжный спорт.",
        "B": "Гимнастика.",
        "C": "Прыжки в длину.",
        "D": "Футбол."
      },
      correctAnswer: "A"
    },
    {
      question: "Какой механизм лежит в основе повышения выносливости при использовании кровяного допинга?",
      options: {
        "A": "Повышение транспорта кислорода к работающим мышцам.",
        "B": "Улучшение диффузии кислорода через альвеолярную мембрану.",
        "C": "Увеличение частоты дыхания.",
        "D": "Уменьшение минутного объёма кровообращения."
      },
      correctAnswer: "A"
    },
    {
      question: "Энергетическая ценность белка:",
      options: {
        "A": "1 ккал.",
        "B": "9 ккал.",
        "C": "4 ккал.",
        "D": "5 ккал."
      },
      correctAnswer: "C"
    },
    {
      question: "Развитие силы связано с:",
      options: {
        "A": "Увеличением суставов.",
        "B": "Снижением кровоснабжения.",
        "C": "Потерей кальция.",
        "D": "Утолщением мышечных волокон."
      },
      correctAnswer: "D"
    },
    {
      question: "Методология педагогики — это:",
      options: {
        "A": "План урока.",
        "B": "Расписание занятий.",
        "C": "Учение о принципах и методах научного познания.",
        "D": "Форма отчёта."
      },
      correctAnswer: "C"
    },
    {
      question: "Индивидуализация обучения — это:",
      options: {
        "A": "Одинаковые задания.",
        "B": "Учёт особенностей каждого обучающегося.",
        "C": "Снижение требований.",
        "D": "Отсутствие контроля."
      },
      correctAnswer: "B"
    },
    {
      question: "Профессиональное выгорание — это:",
      options: {
        "A": "Физическая подготовка.",
        "B": "Дисциплина.",
        "C": "Соревнование.",
        "D": "Эмоциональное истощение."
      },
      correctAnswer: "D"
    },
    {
      question: "Государственный стандарт определяет:",
      options: {
        "A": "Обязательные требования к образованию.",
        "B": "Описание.",
        "C": "Нагрузку.",
        "D": "Соревнования."
      },
      correctAnswer: "A"
    },
    {
      question: "Принцип сознательности и активности предполагает:",
      options: {
        "A": "Пассивное слушание.",
        "B": "Механическое заучивание.",
        "C": "Осознанное и активное участие обучающихся в учебном процессе.",
        "D": "Строгий контроль."
      },
      correctAnswer: "C"
    },
    {
      question: "Цифровые технологии в образовании — это:",
      options: {
        "A": "Печатные материалы.",
        "B": "Устный опрос.",
        "C": "Контроль.",
        "D": "Использование информационно-коммуникационных технологий."
      },
      correctAnswer: "D"
    }
  ],
  12: [
    {
      question: "Как понимается термин «эксперимент»:",
      options: {
        "A": "Создание подходящих условий для исследования.",
        "B": "Восстановление побочных условий.",
        "C": "Научно-методическое исследование.",
        "D": "Формирование направляющих действий."
      },
      correctAnswer: "C"
    },
    {
      question: "Как называются основные процессы, происходящие в организме при выполнении упражнений:",
      options: {
        "A": "Вид физических упражнений.",
        "B": "Содержание физических упражнений.",
        "C": "Строение физических упражнений.",
        "D": "Техника физических упражнений."
      },
      correctAnswer: "C"
    },
    {
      question: "Если техника несложная, её следует выполнять сразу:",
      options: {
        "A": "Расчленённо, затем объединить.",
        "B": "В разных игровых ситуациях (игровой метод).",
        "C": "В разных соревновательных ситуациях.",
        "D": "Целостно."
      },
      correctAnswer: "B"
    },
    {
      question: "Как называется способность совершать движения с большой амплитудой:",
      options: {
        "A": "Гибкость.",
        "B": "Растяжимость.",
        "C": "Прерывистость.",
        "D": "Растянутость."
      },
      correctAnswer: "D"
    },
    {
      question: "Встать ноги врозь на носках, присесть, наклонить тело и голову, прижавшись коленями, опираясь слегка ногами, перекатиться:",
      options: {
        "A": "Мост.",
        "B": "Перекат назад.",
        "C": "Перекат вперёд.",
        "D": "Стойка на лопатках."
      },
      correctAnswer: "A"
    },
    {
      question: "При перестроении из двух шеренг в одну учащиеся второго ряда по команде «раз» выполняют:",
      options: {
        "A": "Левой ногой вправо.",
        "B": "Левой ногой назад.",
        "C": "Правой ногой вперёд.",
        "D": "Левой ногой влево."
      },
      correctAnswer: "B"
    },
    {
      question: "В игре «Пять камней» берут камень-ворота (сака) и подбрасывают его, собирая оставшиеся четыре камня по одному на ладонь другой руки:",
      options: {
        "A": "«Единичка».",
        "B": "«Алакан».",
        "C": "«Жалак».",
        "D": "«Двоечка»."
      },
      correctAnswer: "D"
    },
    {
      question: "Требования к лыжнику:",
      options: {
        "A": "Надевать лёгкую и непродуваемую одежду.",
        "B": "Одеваться как можно теплее.",
        "C": "Кататься на лыжах на льду.",
        "D": "Надевать резиновую обувь."
      },
      correctAnswer: "B"
    },
    {
      question: "Задачи физического воспитания:",
      options: {
        "A": "Развитие, оздоровление, образование.",
        "B": "Оздоровление, образование, воспитание.",
        "C": "Воспитание, физические упражнения, игры.",
        "D": "Образование, игры, обучение."
      },
      correctAnswer: "A"
    },
    {
      question: "Наиболее надёжный способ приёма подачи мяча в волейболе:",
      options: {
        "A": "Приём сверху.",
        "B": "Блокирование.",
        "C": "Приём снизу.",
        "D": "Ладонью, с согнутыми коленями, сверху."
      },
      correctAnswer: "B"
    },
    {
      question: "В лёгкой атлетике за финишем должно быть свободное пространство:",
      options: {
        "A": "3–5 метров.",
        "B": "13–15 метров.",
        "C": "8–10 метров.",
        "D": "1–2 метра."
      },
      correctAnswer: "C"
    },
    {
      question: "Родина гандбола:",
      options: {
        "A": "Россия.",
        "B": "Китай.",
        "C": "США.",
        "D": "Дания."
      },
      correctAnswer: "B"
    },
    {
      question: "Как называется применение принципов мировоззрения и методов познания в философии, изменение бытия:",
      options: {
        "A": "Методология.",
        "B": "Методологический подход.",
        "C": "Методология.",
        "D": "Метод."
      },
      correctAnswer: "D"
    },
    {
      question: "Ацидоз мышечных клеток развивается вследствие:",
      options: {
        "A": "Повышения концентрации кислорода.",
        "B": "Снижения уровня лактата.",
        "C": "Накопления продуктов анаэробного обмена.",
        "D": "Усиления липолиза."
      },
      correctAnswer: "C"
    },
    {
      question: "Какие почечные сосуды участвуют в первичной фильтрации мочи?",
      options: {
        "A": "Перитубулярная капиллярная сеть.",
        "B": "Гемокапилляры почечного тельца.",
        "C": "Артериолы, несущие кровь в почечное тельце.",
        "D": "Артериолы, уносящие кровь из почечного тельца."
      },
      correctAnswer: "B"
    },
    {
      question: "Какой закон механики помогает объяснить, почему при прыжке на батуте спортсмены чередуют потенциальную и кинетическую энергию?",
      options: {
        "A": "Закон сохранения энергии.",
        "B": "Закон инерции.",
        "C": "Закон сохранения массы.",
        "D": "Закон равновесия."
      },
      correctAnswer: "D"
    },
    {
      question: "Какой международный орган определяет перечень запрещённых веществ, влияющих на сердечно-сосудистую и дыхательную системы спортсменов?",
      options: {
        "A": "Всемирное антидопинговое агентство (WADA).",
        "B": "Международный олимпийский комитет.",
        "C": "Национальные федерации, медицинские центры.",
        "D": "Спортивные клубы, федерации."
      },
      correctAnswer: "A"
    },
    {
      question: "Что не относится к форменным элементам клеток крови:",
      options: {
        "A": "Эритроциты.",
        "B": "Лейкоциты.",
        "C": "Нейтрофилы.",
        "D": "Тромбоциты."
      },
      correctAnswer: "C"
    },
    {
      question: "Разминка необходима для:",
      options: {
        "A": "Уменьшения кровотока.",
        "B": "Профилактики травм.",
        "C": "Снижения температуры.",
        "D": "Разрушения белков."
      },
      correctAnswer: "B"
    },
    {
      question: "Теоретические методы исследования включают:",
      options: {
        "A": "Соревнование.",
        "B": "Разминку.",
        "C": "Анализ и синтез.",
        "D": "Тестирование силы."
      },
      correctAnswer: "C"
    },
    {
      question: "Мотивация — это:",
      options: {
        "A": "Контроль.",
        "B": "Побуждение к деятельности.",
        "C": "Наказание.",
        "D": "Соревнование."
      },
      correctAnswer: "B"
    },
    {
      question: "Инновация в образовании — это:",
      options: {
        "A": "Отмена уроков.",
        "B": "Показатели контроля в образовании.",
        "C": "Методы наказания в образовании.",
        "D": "Внедрение новых технологий и методов."
      },
      correctAnswer: "D"
    },
    {
      question: "Права обучающихся включают:",
      options: {
        "A": "Получение качественного образования.",
        "B": "Отказ от обучения.",
        "C": "Дополнение знаний обучающихся.",
        "D": "Игнорирование правил."
      },
      correctAnswer: "A"
    },
    {
      question: "Целостность педагогического процесса — это:",
      options: {
        "A": "Только воспитание.",
        "B": "Только обучение.",
        "C": "Взаимосвязь обучения, воспитания и развития.",
        "D": "Контроль знаний."
      },
      correctAnswer: "C"
    },
    {
      question: "Смешанное обучение — это:",
      options: {
        "A": "Только онлайн.",
        "B": "Только очно.",
        "C": "Факультатив.",
        "D": "Сочетание очного и дистанционного форматов."
      },
      correctAnswer: "D"
    }
  ]
};

export const kazakhTestQuestions: Record<number, QuestionData[]> = {
  1: [
    {
      question: "Дене мәдениетінің ілімі мен әдістемесі нені оқытады:",
      options: {
        "A": "Оқыту заңдылығын.",
        "B": "Тәрбиелеу заңдылығын.",
        "C": "Дене мәдениетінің жалпы заңдылықтарын.",
        "D": "Адамның жас аралық заңдылықтарын."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене мәдениетінің қай түрі негізгі базалық дене дайындығын қамтамасыз етеді:",
      options: {
        "A": "Спорт.",
        "B": "Мектеп дене мәдениеті.",
        "C": "Дене мәдениетінің сауықтыру-рекреативті түрі.",
        "D": "Сауықтыру."
      },
      correctAnswer: "B"
    },
    {
      question: "Қозғалыстың кеңістік-уақыт бірлігіндегі қозғалысқа жатады:",
      options: {
        "A": "Шапшаңдық.",
        "B": "Ырғақ.",
        "C": "Амплитуда.",
        "D": "Жылдамдық."
      },
      correctAnswer: "D"
    },
    {
      question: "Күрделі қимыл-қозғалыстарды алғашқы үйрету кезеңінде көбінесе қандай оқыту тәсілдерін қолданады:",
      options: {
        "A": "Жаттығуларды бөлшектеп-үйрету тәсілі.",
        "B": "Стандартты-үзілісті жаттығулар тәсілі.",
        "C": "Ілеспе әсерлі тәсіл.",
        "D": "Жаттығуларды тұтас-үйрету тәсілі."
      },
      correctAnswer: "A"
    },
    {
      question: "Жалпы білім беретін мектептерде өтілетін дене жаттығуларының ұйымдастырылған негізгі түрін анықта:",
      options: {
        "A": "Күн кестесіндегі физкультуралық-сауықтыру шаралары.",
        "B": "Бұқаралық спорт және туристік шаралар.",
        "C": "Дене тәрбиесінің сабағы.",
        "D": "Спорттық секциядағы жаттығу сабақтары."
      },
      correctAnswer: "C"
    },
    {
      question: "Бұл -- жұмыс қабілеттілігінің төмендігін сипаттайтын, іс-әрекет нәтижесінде туындайтын ағзаның әлсіреуі:",
      options: {
        "A": "сергек көңіл-күй",
        "B": "асқа тәбеттің ашылуы",
        "C": "дене салмағының артуы",
        "D": "шаршау"
      },
      correctAnswer: "D"
    },
    {
      question: "Гимнастика құралдарында секіргенде жерге міндетті түрде түсу керек:",
      options: {
        "A": "сол аяқпен тізені бүгіп",
        "B": "екі аяқпен тізені бүгіп",
        "C": "оң аяқпен тізені бүгіп",
        "D": "өкшемен тізені бүгіп"
      },
      correctAnswer: "B"
    },
    {
      question: "Төзімділікті анықтайтын жаттығулар:",
      options: {
        "A": "кардио жаттығу, жүгіру, кермеге тартылу",
        "B": "күшті дамыту, жүзу, фитнес",
        "C": "статикалық және динамикалық жаттығулар",
        "D": "икемділік, статикалық"
      },
      correctAnswer: "A"
    },
    {
      question: "Баскетболшылардың пайдалануға қолайлы техникалық іс-әрекеттер саны",
      options: {
        "A": "70 шамалы",
        "B": "80 шамалы",
        "C": "60 шамалы",
        "D": "90 шамалы"
      },
      correctAnswer: "C"
    },
    {
      question: "Футболда алаңдағы киімі басқалардан бөлек болатын ойыншы",
      options: {
        "A": "капитан",
        "B": "қорғаушы",
        "C": "қақпашы",
        "D": "шабуылшы"
      },
      correctAnswer: "C"
    },
    {
      question: "Гандболда шабуылдағы топпен әрекет етуі",
      options: {
        "A": "жекелеген ойыншылардың үйлесімді іс-қимылдарынан құралады",
        "B": "жекелеген ойыншының допқа ие болу іс-қимылдарынан құралады",
        "C": "жекелеген ойыншының қорғану әрекетінен тұрады",
        "D": "жекелеген ойыншылардың тосқауыл қоюынан құралады"
      },
      correctAnswer: "A"
    },
    {
      question: "Әйелдер қолданатын ядроның массасы",
      options: {
        "A": "2 кг",
        "B": "3 кг",
        "C": "5 кг",
        "D": "4 кг"
      },
      correctAnswer: "D"
    },
    {
      question: "Спорттық ойын түрі",
      options: {
        "A": "Гимнастика",
        "B": "Ұлттық ойын",
        "C": "Футбол",
        "D": "Топтық ойын"
      },
      correctAnswer: "C"
    },
    {
      question: "Қандай тұжырым спорттық бейімделудегі ACTN3 генінің маңыздылығын дұрыс көрсетеді?",
      options: {
        "A": "ACTN3 гені тек төзімділікті анықтайды және жылдамдық қасиеттеріне әсер етпейді.",
        "B": "ACTN3 жаттығу кезінде инсулин синтезін реттейді.",
        "C": "ACTN3-тің белгілі бір нұсқаларының болуы жылдамдық қабілеттерін дамытуға бейім болуы мүмкін",
        "D": "Бұл ACTN3 ген жаттығуға қарамастан баяу бұлшықет талшықтарының пайда болуына жауап береді."
      },
      correctAnswer: "C"
    },
    {
      question: "Созылмалы шаршау мен шамадан тыс жаттығулардан туындаған қандай жағдай бауыр-ауырсыну синдромының дамуына себеп болады?",
      options: {
        "A": "Ақуыздардың көбеюі және майлардың баяу ыдырауы",
        "B": "Қандағы глюкозаның төмендеуі",
        "C": "Ақуыздардың ыдырауының жоғарылауы және олардың түзілуінің баяулауы",
        "D": "Су-тұз балансының бұзылуы"
      },
      correctAnswer: "B"
    },
    {
      question: "Бүйректің дистальді түтікшелеріндегі тығыз жасушаларының пішіні қандай:",
      options: {
        "A": "жалпақ",
        "B": "өсінділі",
        "C": "дөңгелек",
        "D": "призмалы"
      },
      correctAnswer: "D"
    },
    {
      question: "Денің немесе заттың бұрыштық жағдайының өзгеруімен байланысты қозғалыс қалай аталады?",
      options: {
        "A": "Айналмалы қозғалыс",
        "B": "Түзу сызықты қозғалыс",
        "C": "Сызықтық қозғалыс",
        "D": "Тербелмелі қозғалыс"
      },
      correctAnswer: "A"
    },
    {
      question: "Қарқынды жүктемелер аясында стимуляторларды ұзақ уақыт қолданғанда қандай жағдай дамуы мүмкін?",
      options: {
        "A": "Жүректің физиологиялық гипертрофиясы",
        "B": "Миокардтың серпімділігінің артуы",
        "C": "Кардиомиопатия және жүрек ырғағының бұзылуы",
        "D": "Коронарлық қан айналымының жақсаруы"
      },
      correctAnswer: "C"
    },
    {
      question: "Қанның қызметі қандай?",
      options: {
        "A": "тағамдық",
        "B": "тыныс алу",
        "C": "экскреторлық",
        "D": "жоғарыда айтылғандардың барлығы дұрыс"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогика - бұл:",
      options: {
        "A": "спорт туралы ғылым",
        "B": "философияның бір бөлімі",
        "C": "жеке тұлғаны тәрбиелеу, оқыту және дамыту туралы ғылым",
        "D": "жаттығу әдісі"
      },
      correctAnswer: "C"
    },
    {
      question: "Эмпирикалық әдістер - бұл:",
      options: {
        "A": "жоспарлау",
        "B": "бақылау және эксперимент",
        "C": "түсіндіру",
        "D": "лекция"
      },
      correctAnswer: "B"
    },
    {
      question: "Рефлексия - бұл:",
      options: {
        "A": "жарыс",
        "B": "жазалау",
        "C": "тестілеу",
        "D": "өзіндік іс-әрекетті талдау"
      },
      correctAnswer: "D"
    },
    {
      question: "Тұлғаға бағытталған оқыту мынаны көздейді:",
      options: {
        "A": "білім алушының жеке ерекшеліктерін ескеру",
        "B": "бірдей талаптар қою",
        "C": "қатаң бақылау",
        "D": "ең төмен белсенділік"
      },
      correctAnswer: "A"
    },
    {
      question: "Педагогтың жауапкершілігі мыналарды қамтиды:",
      options: {
        "A": "бақылауды күшейту",
        "B": "білім алушыларды жазалау",
        "C": "білім алушылардың қауіпсіздігін қамтамасыз ету",
        "D": "жарыстарды жиі ұйымдастыру"
      },
      correctAnswer: "C"
    },
    {
      question: "Сендіру әдісі дегеніміз:",
      options: {
        "A": "жазалау",
        "B": "жарыс",
        "C": "бақылау",
        "D": "білім алушылардың санасы мен көзқарасына ықпал ету"
      },
      correctAnswer: "D"
    }
  ],
  2: [
    {
      question: "Жаңа білімді анықтап, дене мәдениеті факторларының заңдылықтар бағытының әсерін, адамның дене дайындығын жетілдіру мақсаты бар бағытты не дейміз:",
      options: {
        "A": "Дене мәдениеті мен спорт ілімі.",
        "B": "Дене мәдениеті мен спорт тарихы.",
        "C": "Дене мәдениеті мен спорт сферасындағы ғылым.",
        "D": "Таңдап алынған спорт әдістемесі."
      },
      correctAnswer: "C"
    },
    {
      question: "Жалпы білім беру мектебіндегі дене тәрбиесі сабағы:",
      options: {
        "A": "Қолданбалы дене дайындығы сабағы.",
        "B": "Дене мәдениетінің базалық сабақ түрі.",
        "C": "Емдік-сабақ түрі.",
        "D": "Спорттық сабақ түрі."
      },
      correctAnswer: "B"
    },
    {
      question: "Дене жаттығуларының динамикалық сипаттамасына қайсысы жатады:",
      options: {
        "A": "Ритм (ырғақ).",
        "B": "Темп (шапшаңдық).",
        "C": "Жылдамдату.",
        "D": "Күш импульсі."
      },
      correctAnswer: "D"
    },
    {
      question: "Қозғалмалы ойындарда командалық рухты дамытатын ойын түрі",
      options: {
        "A": "логикалық ойындар",
        "B": "эстафеталық ойындар",
        "C": "рөлдік ойындар",
        "D": "жеке ойындар"
      },
      correctAnswer: "B"
    },
    {
      question: "Қол добы ойынында қақпашыға рұқсат етілмейді",
      options: {
        "A": "қақпа алаңында допқа дененің кез келген бөлігімен жанасу",
        "B": "қақпа алаңында доппен қозғалуға, тек ұзақ ұстамауға",
        "C": "қақпаны қорғау барысында қарсыласқа қауіп төндірмеу",
        "D": "қақпа алаңынан допсыз шығып ойнауға"
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда шабуылдаушы үшін ең тиімді тактика",
      options: {
        "A": "ойындағы тиімді уақытты таңдау",
        "B": "қарсыласына назар аудармау",
        "C": "тек жылдам жүгіру",
        "D": "допты ұзақ ұстау"
      },
      correctAnswer: "A"
    },
    {
      question: "Оқушылардың қимыл-қозғалыс қасиеттерінің көрсеткіштерін қимыл эстетикасы тұрғысынан жақсартатын жаттығулар",
      options: {
        "A": "Күш дамыту жаттығулары",
        "B": "Саптағы жаттығулар",
        "C": "Жылдамдықты дамытатын жаттығулар",
        "D": "Ырғақты гимнастика жаттығулары"
      },
      correctAnswer: "D"
    },
    {
      question: "Футболда пенальти",
      options: {
        "A": "10 м ойыннан кейінгі серия, ережені бұзу",
        "B": "12 м ойыннан кейінгі серия, ережені бұзу",
        "C": "11 м ойыннан кейінгі серия, ережені бұзу",
        "D": "9 м ойыннан кейінгі серия, ережені бұзу"
      },
      correctAnswer: "C"
    },
    {
      question: "Қалқанша безінің гормондарының жаттығу кезіндегі физиологиялық рөлі қандай?",
      options: {
        "A": "Тек ақуыз алмасуын реттеу.",
        "B": "Катаболикалық процестерді басу.",
        "C": "Метаболизмнің барлық түрлерін реттеуге қатысу және бұлшықет жұмысында липидтер алмасуының жоғарылауы.",
        "D": "Энергияны үнемдеу үшін негізгі алмасуды азайту."
      },
      correctAnswer: "C"
    },
    {
      question: "Бас миы мен жұлын арасындағы байланыстарды құрайтын ақ заттың талшықтары:",
      options: {
        "A": "коллаген",
        "B": "Миелинді талшықтар",
        "C": "эластин",
        "D": "преколлаген"
      },
      correctAnswer: "B"
    },
    {
      question: "Эктоморф қандай типтегі адамдар.",
      options: {
        "A": "Бұлшықетті, күшті денелі тип",
        "B": "Домалақ, жұмасақ денелі тип",
        "C": "Май жинақтауға бейімді",
        "D": "Жіңішке, ұзын денелі тип"
      },
      correctAnswer: "D"
    },
    {
      question: "Гантельді төмен түсіру кезінде қандай бұлшықет жиырылуы болады?",
      options: {
        "A": "Эксцентрлік",
        "B": "Изометриялық",
        "C": "Концентрлік",
        "D": "Изотониялық"
      },
      correctAnswer: "A"
    },
    {
      question: "Жүрек-қантамыр жүйесінің жүктемеге реакциясын бағалауда ең жиі қолданылатын көрсеткіш:",
      options: {
        "A": "Артериялық қан қысымы",
        "B": "Дене салмағы",
        "C": "Жүрек соғу жиілігі",
        "D": "Дене температурасы"
      },
      correctAnswer: "C"
    },
    {
      question: "Эритроцит орта есеппен қанша уақыт өмір сүреді?",
      options: {
        "A": "20 күн;",
        "B": "40 күн;",
        "C": "80 күн;",
        "D": "120 күн."
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогиканың объектісі - бұл:",
      options: {
        "A": "спорттық жарыстар",
        "B": "оқу жоспары",
        "C": "тұтас педагогикалық процесс",
        "D": "нормативтік құжаттар"
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогикалық эксперимент - бұл:",
      options: {
        "A": "жарыс",
        "B": "оқыту практикасында гипотезаны тексеру",
        "C": "жаттығу",
        "D": "емтихан"
      },
      correctAnswer: "B"
    },
    {
      question: "Тәрбие - бұл:",
      options: {
        "A": "білімді бақылау",
        "B": "жарыс",
        "C": "демалыс",
        "D": "тұлғаны мақсатты қалыптастыруға бағытталған процесс"
      },
      correctAnswer: "D"
    },
    {
      question: "Қашықтан оқыту - бұл:",
      options: {
        "A": "цифрлық технологияларды пайдалану арқылы оқыту",
        "B": "жарыстарды телеэкраннан көру",
        "C": "жаттықтыру залында жаттығу жасау",
        "D": "аудиторияда емтихан тапсыру"
      },
      correctAnswer: "A"
    },
    {
      question: "Еңбекті қорғау:",
      options: {
        "A": "жүктемені арттыру",
        "B": "білім алушыларды жарысқа баулу",
        "C": "қауіпсіздік нормаларын сақтау",
        "D": "бақылау түрлері"
      },
      correctAnswer: "C"
    },
    {
      question: "Ынталандыру әдісі мынаны білдіреді:",
      options: {
        "A": "талаптарды төмендету",
        "B": "жазалау",
        "C": "елемеу",
        "D": "оң мінез-құлықты ынталандыру"
      },
      correctAnswer: "D"
    }
  ],
  3: [
    {
      question: "Дене мәдениеті ілімі мен әдістемесіндегі ілімдік, әдістемелік жағдайларды қандай бөлім оқытады:",
      options: {
        "A": "Спорттық жаттығу.",
        "B": "Кәсіптік қолданбалы дайындық.",
        "C": "Дене мәдениеті ілімі мен әдістемесінің жалпы негіздері.",
        "D": "Оқушылар дене тәрбиесінің ілімі мен әдістемесі."
      },
      correctAnswer: "C"
    },
    {
      question: "Қоғамдағы дене тәрбиесінің пайда болуына қандай себептер негіз болды: алдын ала дайындықтың қажеттілігі және олардың өзара қарым-қатынас орнатуы. прогрессивті мәні.",
      options: {
        "A": "Ғылыми зерттеудің нәтижесі.",
        "B": "Адамдардың саналы түрде жаттығуларды түсінуі, адам өміріндегі",
        "C": "Адамды үйлесімді дамытып тәрбиелеудің мазмұны, жолдары мен",
        "D": "Еңбекпен шұғылдану ісі."
      },
      correctAnswer: "B"
    },
    {
      question: "Ырғақтылық -- дене жаттығуларының әдіс-айласының кешенді сипатының шағылуы: динамикалық өзгеруінің бірізділігі. әрекеттері.",
      options: {
        "A": "Қозғалыс уақытының бірліктегі жиілігі.",
        "B": "Қозғалыстың ішкі және сыртқы күштерінің қозғалысындағы бірлескен",
        "C": "Қимыл-қозғалыс дәлдігі мен соңғы нәтижесі.",
        "D": "Уақыт және кеңістікте күшті реттеу заңдылығы, қозғалыстың"
      },
      correctAnswer: "D"
    },
    {
      question: "Әдіс-айланы жоғары деңгейде игеру:",
      options: {
        "A": "Қозғалыс дағдысы.",
        "B": "Қозғалыс іскерлігі.",
        "C": "Әдіс-айла шеберлігі.",
        "D": "Қозғалыс дарындылығы."
      },
      correctAnswer: "C"
    },
    {
      question: "Баскетболда допты алып жүруге болмайды",
      options: {
        "A": "екі қолмен кезектестіріп соғып алып жүру",
        "B": "оң қолмен сатып алып жүру",
        "C": "екі қолмен бір мезгілде соғып алып жүру",
        "D": "сол қолмен сатып алып жүру"
      },
      correctAnswer: "C"
    },
    {
      question: "Жинақы, түзу, бұлшық етті қатайтпай, аяқ өкшелерін бірге, ұшын сәл ғана алшақ ұстап, қолды жанға жіберіп, саусақты жартылай бүгіп, тіке алға қарап тұру:",
      options: {
        "A": "лекпен тұрған кезде",
        "B": "еркін тұрған кезде",
        "C": "шеңбермен тұрған кезде",
        "D": "сапта тұрған кезде"
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда қорғаныста «зоналық қорғау» әдісінің ерекшелігі:",
      options: {
        "A": "бүкіл командамен бірге қорғану",
        "B": "әр ойыншы өз аймағын қорғауы",
        "C": "тек бір ойыншыны қорғау",
        "D": "тек қарсыласқа назар аудару"
      },
      correctAnswer: "B"
    },
    {
      question: "Тәсіл бір аяқ алға қойылған, дененің салмағы екі аяққа бірдей түскен, кеуде допты лақтыратын қолға қарай аздап еңкейген қалыпта орындалады (гандбол):",
      options: {
        "A": "жоғарыдан беру",
        "B": "қолдың арасынан беру",
        "C": "астынан беру",
        "D": "бүйірден беру"
      },
      correctAnswer: "A"
    },
    {
      question: "Тоғызқұмалақ ойының ойнау үшін ойыншыларға берілетін жалпы құмалақтардың саны",
      options: {
        "A": "9",
        "B": "162",
        "C": "18",
        "D": "81"
      },
      correctAnswer: "B"
    },
    {
      question: "Кеудемен құлаштап еркін жүзуде дененің орналасуы",
      options: {
        "A": "судың астында",
        "B": "басы судың ішінде",
        "C": "көлденең",
        "D": "шалқалап"
      },
      correctAnswer: "C"
    },
    {
      question: "Волейбол добын жоғарыдан тіке ойынға қосудағы үйлесімділік",
      options: {
        "A": "допты жоғарыдан лақтыру, құлаштай сермеу, ұру",
        "B": "допты төменнен лақтыру, құлаштай сермеу, ұру",
        "C": "допты жоғарыдан төмен лақтыру, сермеу, ұру",
        "D": "допты төменнен лақтыру, құлаштай сермеу, екі қолмен ұру"
      },
      correctAnswer: "A"
    },
    {
      question: "Бұлардың қалыпты жеке қимыл жасау мөлшерінде дененің иілгіштігін сақтауға және дамытуға себепші жаттығулар",
      options: {
        "A": "Жалпы дамыту жаттығулары",
        "B": "Еркін жаттығулар",
        "C": "Бой жазу жаттығулары",
        "D": "Керіліп-созылуға арналған жаттығулар"
      },
      correctAnswer: "D"
    },
    {
      question: "Тоғызқұмалақ ойын тақасындағы барлық отаулардың саны",
      options: {
        "A": "2",
        "B": "81",
        "C": "18",
        "D": "9"
      },
      correctAnswer: "D"
    },
    {
      question: "Физиологиялық тұрғыдан қозғалыс дағдысының мәні неде?",
      options: {
        "A": "Бұрыннан бар шартсыз реакцияның қарапайым қайталануы.",
        "B": "Үлкен жарты шар қыртысының қатысуынсыз туа біткен қозғалыс әрекетін жүзеге асыру.",
        "C": "қозғалтқыш реакциясының афферентті және эфферентті буындарын қамтитын оперантты (аспаптық) уақытша байланыстардың түзілуі.",
        "D": "Тек сенсорлық байланыстарды қалыптастыру."
      },
      correctAnswer: "C"
    },
    {
      question: "Жұлынның сұр затының ақ затынан ерекшелігі",
      options: {
        "A": "миелинді талшықтар бар",
        "B": "нерв жасушалары бар",
        "C": "коллаген талшықтар бар",
        "D": "эластин талшықтар бар"
      },
      correctAnswer: "B"
    },
    {
      question: "Спорттық биомеханикада техниканы талдаудың негізгі аспектісі қандай?",
      options: {
        "A": "Спорттық жабдық пен қоршаған орта сияқты сыртқы факторларды бағалау",
        "B": "Спорттық тамақтану бағдарламалары мен диеталарды әзірлеу",
        "C": "Жаттығу орындау кезіндегі спортшының эмоциялық реакцияларын талдау",
        "D": "Жаттығу орындау кезінде спортшы денесіне әсер ететін күштерді және олардың таралуын талдау"
      },
      correctAnswer: "D"
    },
    {
      question: "Ұзындыққа секіруде ең тиімді итерілу бұрышы қандай?",
      options: {
        "A": "45 градус",
        "B": "30 градус",
        "C": "90 градус",
        "D": "60 градус"
      },
      correctAnswer: "A"
    },
    {
      question: "Организмнің орталық жүйке жүйесінің бөліктерін қамтитын рецепторлардың тітіркенуі кезінде пайда болатын реакциясы қалай аталады?",
      options: {
        "A": "Лабилділік",
        "B": "Жүйке орталығы",
        "C": "Рефлекс",
        "D": "Ынталандыру"
      },
      correctAnswer: "C"
    },
    {
      question: "Қанның қандай түрлерін білесіз?",
      options: {
        "A": "артериялық",
        "B": "веноздық",
        "C": "қан айналымы",
        "D": "жоғарыда айтылғандардың барлығы дұрыс"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогиканың пәні - бұл:",
      options: {
        "A": "жаттығу техникасы",
        "B": "медициналық көрсеткіштер",
        "C": "оқыту мен тәрбиелеудің заңдылықтары",
        "D": "білімді бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Бақылау - бұл:",
      options: {
        "A": "білім алушылардың білімін тексеру",
        "B": "педагогикалық құбылыстарды мақсатты түрде қабылдау",
        "C": "тәртіпті бақылау",
        "D": "бағалау"
      },
      correctAnswer: "B"
    },
    {
      question: "Адамгершілік тәрбие мыналарға бағытталған:",
      options: {
        "A": "күшті дамыту",
        "B": "икемділік",
        "C": "төзімділік",
        "D": "моральдық құндылықтарды қалыптастыру"
      },
      correctAnswer: "D"
    },
    {
      question: "Ойын технологиясы мыналарды қамтиды:",
      options: {
        "A": "ойынды оқыту әдісі ретінде пайдалану",
        "B": "жазалау жолы ретінде қолдану",
        "C": "бақылау әдісі ретінде қолдану",
        "D": "дәріс беру"
      },
      correctAnswer: "A"
    },
    {
      question: "Жаттықтырушылық іс-әрекет - бұл:",
      options: {
        "A": "төрешілік ету",
        "B": "менеджмент",
        "C": "спортшыларды оқыту және тәрбиелеу бойынша педагогикалық процесс",
        "D": "медициналық қызмет"
      },
      correctAnswer: "C"
    },
    {
      question: "Талап қою әдісі дегеніміз:",
      options: {
        "A": "мадақтау",
        "B": "жарыс",
        "C": "бақылау",
        "D": "мінез-құлық нормалары мен ережелерін ұсыну"
      },
      correctAnswer: "D"
    }
  ],
  4: [
    {
      question: "Тәрбие түрі, қозғалысқа үйрету, қозғалыс сапаларын дамыту, арнайы дене мәдениетінің білімін игеруін қалай атайды:",
      options: {
        "A": "Дене мәдениеті.",
        "B": "Дене дайындығы.",
        "C": "Дене тәрбиесі.",
        "D": "Дене тәрбиесінің білімі."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене тәрбиесінің әлеуметтік тәжірибесінің тарихи түрі, дүниетанымдық көзқарасы, ілімдік-әдістемелік және ұйымдық негізінің адамдардың денесін жетілдіріп, салауатты өмір салтын қалыптастыруды қамтамасыз етуі:",
      options: {
        "A": "Валеология.",
        "B": "Дене тәрбиесі жүйесі.",
        "C": "Дене мәдениеті.",
        "D": "Спортпен."
      },
      correctAnswer: "B"
    },
    {
      question: "Дене тәрбиесіндегі тәсіл деп: қимыл-қозғалысты орындау.",
      options: {
        "A": "Негізгі қалып, мазмұнын анықтау, оқыту түрлерін ұйымдастыру.",
        "B": "Сол басқару жағдайлары, жаттығуларды орындау себептері,",
        "C": "Қимыл-қозғалыстарды орындататын тиянақты себептер.",
        "D": "Дене жаттығуын орындаудағы жолы."
      },
      correctAnswer: "D"
    },
    {
      question: "Қозғалыс сапасы -- бұл: ерекшелігі. көрсететін кешенді қабілеті.",
      options: {
        "A": "Туа біткен морфофункционалды сапа.",
        "B": "Адамның қозғалыс мүмкіндігін анықтаушы деңгейі, жеке-дара",
        "C": "Адамның нақты кешенді қимыл-қозғалыста көрінетін қабілеті.",
        "D": "Дене мәдениеті және спортпен шұғылданғанда нақты нәтиже"
      },
      correctAnswer: "C"
    },
    {
      question: "Граната лақтыратын дәліздің ені",
      options: {
        "A": "12 m",
        "B": "8 м",
        "C": "10 m",
        "D": "15 м"
      },
      correctAnswer: "C"
    },
    {
      question: "Тоғызқұмалақ ойынында құмалақтардың саны тақ болып тұрған отауды атайды:",
      options: {
        "A": "атсұраттар",
        "B": "жабық отау",
        "C": "маңдай",
        "D": "ашық отау"
      },
      correctAnswer: "D"
    },
    {
      question: "Футбол алаңының ұзындығы:",
      options: {
        "A": "120--140 м",
        "B": "100--110 м",
        "C": "60--80 м",
        "D": "80--100 м"
      },
      correctAnswer: "B"
    },
    {
      question: "Коньки тебудің түрлері:",
      options: {
        "A": "3",
        "B": "4",
        "C": "2",
        "D": "1"
      },
      correctAnswer: "C"
    },
    {
      question: "Жүзудің танымал және жылдам әдісі",
      options: {
        "A": "брасс",
        "B": "кроль",
        "C": "дельфин",
        "D": "баттерфляй"
      },
      correctAnswer: "B"
    },
    {
      question: "Тоғызқұмалақ ойынында жеңіске жету үшін ең кемінде жинау керек құмалақтың саны",
      options: {
        "A": "79",
        "B": "81",
        "C": "82",
        "D": "80"
      },
      correctAnswer: "C"
    },
    {
      question: "Волейбол добын бір қолмен қарсылас жаққа тордың жоғары жиегінен асырып түсірумен аяқталатын техникалық тәсіл",
      options: {
        "A": "шабуыл",
        "B": "допты көтеру",
        "C": "тосқауыл",
        "D": "допты беру"
      },
      correctAnswer: "A"
    },
    {
      question: "Берене немесе гимнастикалық орындыкте орындалады",
      options: {
        "A": "Саппен орындалатын жаттығулар",
        "B": "Жүгіру жаттығулары",
        "C": "Таңертеңгілік бой жазу жаттығулары",
        "D": "Тепе-теңдік жаттығулары"
      },
      correctAnswer: "D"
    },
    {
      question: "Тоғызқұмалақ қазандардың саны ойын тақтасындағы қазандардың саны",
      options: {
        "A": "9",
        "B": "81",
        "C": "2",
        "D": "18"
      },
      correctAnswer: "D"
    },
    {
      question: "Қозғалыс дағдыны қалыптастыру кезінде динамикалық стереотипке не тән?",
      options: {
        "A": "Қозғалыс фазаларының тұрақты тізбегінің толық болмауы.",
        "B": "Тек ациклді жаттығулармен қалыптастыру.",
        "C": "Қозғалыстың дәйекті ауыспалы фазаларының тұрақты жүйесі, әсіресе циклдік жаттығуларда айқын көрінеді.",
        "D": "Тек туа біткен сипат."
      },
      correctAnswer: "C"
    },
    {
      question: "Жүректегі тегіс салалы ет жасушаларының орналасқан жері:",
      options: {
        "A": "Миокардта",
        "B": "Эндокардта",
        "C": "Эпикардта",
        "D": "Перикардта"
      },
      correctAnswer: "B"
    },
    {
      question: "Спорттық биомеханикада күш пен қозғалысты талдау үшін ең жиі қолданылатын құрал қандай?",
      options: {
        "A": "Жүрек қызметін бақылауға арналған ЭКГ аппараты",
        "B": "Бұрыштық орын ауыстыруды бағалайтын гироскоп",
        "C": "Бұлшықет белсенділігін тіркейтін электромиограф",
        "D": "Қозғалысты жазып, талдайтын бейнекамера"
      },
      correctAnswer: "D"
    },
    {
      question: "Ауа мен қан арасындағы газ алмасу жүретін негізгі анатомиялық құрылым:",
      options: {
        "A": "Альвеолалар",
        "B": "Орташа калибрлі бронхтар",
        "C": "Терминалдық бронхиолалар",
        "D": "Плевра қуысы"
      },
      correctAnswer: "A"
    },
    {
      question: "Шаршаған кезде рефлекс ұзақтығы:",
      options: {
        "A": "Қысқартады",
        "B": "Өзгеріссіз қалады",
        "C": "Артады",
        "D": "Өзгереді"
      },
      correctAnswer: "C"
    },
    {
      question: "Жаңа туған нәрестеде ересектерге қарағанда сүйектердің саны көп, өйткені:",
      options: {
        "A": "Сүйектер қалың",
        "B": "Буындар жоқ",
        "C": "Сүйек кемігі жоқ",
        "D": "Кейбір сүйектер әлі өскен жоқ"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогиканың негізгі функциясы:",
      options: {
        "A": "жарыстарды ұйымдастыру",
        "B": "төрешілерді даярлау",
        "C": "білім беруді ғылыми негіздеу",
        "D": "медициналық бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Дидактика - бұл:",
      options: {
        "A": "спорт теориясы",
        "B": "оқыту теориясы",
        "C": "жарыстар әдістемесі",
        "D": "мектепті басқару"
      },
      correctAnswer: "B"
    },
    {
      question: "Азаматтық-патриоттық тәрбие мыналарды қалыптастырады:",
      options: {
        "A": "спорттық дағдыларды",
        "B": "физикалық қасиеттерді",
        "C": "техниканы",
        "D": "қоғам алдындағы жауапкершілік сезімін"
      },
      correctAnswer: "D"
    },
    {
      question: "Жобалық оқыту - бұл:",
      options: {
        "A": "практикалық тапсырма бойынша өзіндік жұмыс",
        "B": "тестілеу",
        "C": "бақылау жұмыстары",
        "D": "тәртіп"
      },
      correctAnswer: "A"
    },
    {
      question: "Жаттығу процесіндегі жеке тәсілдеме - бұл:",
      options: {
        "A": "бірдей жүктеме беру",
        "B": "жазалау",
        "C": "спортшының физикалық және психологиялық ерекшеліктерін ескеру",
        "D": "жарыс өткізу"
      },
      correctAnswer: "C"
    },
    {
      question: "Ұжым дегеніміз:",
      options: {
        "A": "кездейсоқ топ",
        "B": "мақсаты жоқ спорттық команда",
        "C": "әкімшілік құрылым",
        "D": "ортақ мақсат пен іс-әрекет арқылы біріктірілген адамдар тобы"
      },
      correctAnswer: "D"
    }
  ],
  5: [
    {
      question: "Адам денесінің дамуын сипаттайтын көрсеткіштерге жататын: көрсеткіштері. сапасы.",
      options: {
        "A": "Спорттық көрсеткіштері мен дене дайындығы деңгейінің",
        "B": "Өмірге керекті іскерлік пен дағдысының деңгейі мен қалыптасу",
        "C": "Дене құрылысы, денсаулығы мен қозғалыс сапаларының дамуы.",
        "D": "Спорттық іскерлік пен дағдысының деңгейі мен қалыптасу сапасы."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене тәрбиесі жүйесінің сипаты: ұйымдастыру негізі.",
      options: {
        "A": "Дене тәрбиесінің қағидалары, мақсаты, міндеті.",
        "B": "Ғылыми-әдістемелік, бағдарлы нормативті және дене тәрбиесінің",
        "C": "Функциялық жүйесінің жағдайы.",
        "D": "Дене тәрбиесінің бағдары-нормативі."
      },
      correctAnswer: "B"
    },
    {
      question: "Мұғалімнің оқушылармен қарым-қатынасын орнатуда, іскерлік, дағды және білім беру жолдарын қалай атайды:",
      options: {
        "A": "Қимыл-қозғалыстар.",
        "B": "Оқыту әдістемесі.",
        "C": "Үйрету мен оқыту.",
        "D": "Оқыту тәсілі."
      },
      correctAnswer: "D"
    },
    {
      question: "Күш -- бұл: жатады.",
      options: {
        "A": "Сыртқы ортаның әсеріне қарсы тұру қабілеті.",
        "B": "Адам қозғалысының анықтаушы бір түрі, негізіне «бұлшық ет» әсері",
        "C": "Қысқа уақыт ішінде бұлшық ет күшімен әсер ету.",
        "D": "Адамның көп мөлшерде күш жұмсау қабілеті."
      },
      correctAnswer: "D"
    },
    {
      question: "Қол добында алаңдағы алмастыруға болады:",
      options: {
        "A": "екі рет алмастыруға болады ойыншыларды",
        "B": "мүлдем алмастыруға болмайды",
        "C": "қанша болса да алмастыруға болады",
        "D": "бір рет қана алмастыруға болады"
      },
      correctAnswer: "C"
    },
    {
      question: "Бұл жүрісте аяқ пен қолдың қозғалысы жай жүрістегідей ауысып отырады. Қозғалыс екі рет таяқпен итерілу арқылы орындалады:",
      options: {
        "A": "ауыспалы төрт адымды жүріс",
        "B": "бір мезгілдегі бір адымды жүріс",
        "C": "конькише жүріс",
        "D": "ауыспалы екі адымды жүріс"
      },
      correctAnswer: "D"
    },
    {
      question: "Футболшының орын ауыстыруы:",
      options: {
        "A": "допты өкшемен тоқтату",
        "B": "жүру, жүгіру, бұрылу, секіру",
        "C": "аяқтың сыртқы қырымен тебу",
        "D": "допты аяқтың ұшымен тебу"
      },
      correctAnswer: "B"
    },
    {
      question: "Мәнерлеп сырғанауға арналған коньки",
      options: {
        "A": "мәнерлеп сырғанауға арналған коньки",
        "B": "допты хоккейге арналған коньки",
        "C": "хоккей ойынына арналған коньки",
        "D": "мұз үстінде жүгірге арналған коньки"
      },
      correctAnswer: "A"
    },
    {
      question: "Биіктікке секіру кезінде орындалатын соңғы адым",
      options: {
        "A": "үш адым",
        "B": "қысқа адым",
        "C": "секіру",
        "D": "екі адым"
      },
      correctAnswer: "B"
    },
    {
      question: "Баскетбол қалқаны бағанадан қашықтықта бекітіледі",
      options: {
        "A": "140 см",
        "B": "150 см",
        "C": "120 см",
        "D": "130 см"
      },
      correctAnswer: "D"
    },
    {
      question: "Қорғану іс-әрекетін шабуылдаумен тікелей байланыстыратын, шабуылдың ең маңызды элементі",
      options: {
        "A": "допты беру",
        "B": "допты ойынға қосу",
        "C": "допқа тосқауыл қою",
        "D": "допты ойыннан үзіп алу"
      },
      correctAnswer: "D"
    },
    {
      question: "Асылудан күшпен көтеріліп, артқа аударылып түсіп, таянып тұру орындалады",
      options: {
        "A": "Беренеде",
        "B": "Арқанда",
        "C": "Ағаш атта",
        "D": "Белтемірде"
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда допты қарсылас команданың торының астында ұстап тұруға болмайды",
      options: {
        "A": "6 секундтан артық",
        "B": "4 секундтан артық",
        "C": "3 секундтан артық",
        "D": "5 секундтан артық"
      },
      correctAnswer: "C"
    },
    {
      question: "Қозғалыс белсенділігінде экстраполяция дегеніміз не?",
      options: {
        "A": "Қатаң бекітілген қозғалыс тізбегін қайталау.",
        "B": "Ескі қозғалыс дағдысыны жойылуы.",
        "C": "Бұрын қалыптасқан уақытша байланыстарға негізделген жүйке жүйесінің жаңа қозғалыс мәселелерін шешу қабілеті.",
        "D": "Генетикалық тұрғыдан алдын-ала анықталған үйлестіру қабілеті."
      },
      correctAnswer: "C"
    },
    {
      question: "Миокардтың негізін түзетін қайсысы:",
      options: {
        "A": "Адипоциттер",
        "B": "Жырылғыш кардиомиоциттер",
        "C": "тегіс салалы ет жасушалары",
        "D": "адипоциттер"
      },
      correctAnswer: "B"
    },
    {
      question: "Спортшы денесіне әсер ететін күштерді зерттеу үшін қандай әдіс қолданылады?",
      options: {
        "A": "Термография -- тіндердегі жылулық өзгерістерді зерттеу",
        "B": "Гидродинамикалық талдау -- су спорт түрлеріндегі су күштерінің әсерін бағалау",
        "C": "Энергетикалық талдау -- жаттығу кезіндегі энергия шығынын зерттеу",
        "D": "Күштердің статикалық және динамикалық талдауы -- спортшы денесіне әсер ететін күштерді анықтау және талдау"
      },
      correctAnswer: "D"
    },
    {
      question: "Төзімділікке бағытталған жүктемелерге бейімделудің белгісі болып табылатын тыныс алу жүйесіндегі физиологиялық өзгеріс:",
      options: {
        "A": "Өкпенің тіршілік сыйымдылығының артуы",
        "B": "Тыныс алу коэффициентінің жоғарылауы",
        "C": "Өкпенің тіршілік сыйымдылығының төмендеуі",
        "D": "Өкпенің диффузиялық қабілетінің төмендеуі"
      },
      correctAnswer: "A"
    },
    {
      question: "Дені сау адамдағы айналымдағы қан көлемі:",
      options: {
        "A": "10%",
        "B": "4%",
        "C": "7%",
        "D": "2%"
      },
      correctAnswer: "C"
    },
    {
      question: "Өсу аймақтарын жабу:",
      options: {
        "A": "Ерте балалық шағында",
        "B": "Егде жаста",
        "C": "Жаңа туған кезде",
        "D": "Жасөспірімдік жаста"
      },
      correctAnswer: "D"
    },
    {
      question: "Білім беру - бұл:",
      options: {
        "A": "тәрбие принциптері мен заңдылықтары",
        "B": "оқу мүмкіндіктері мен жолдары",
        "C": "білімді меңгеру және тұлғаны дамыту процесі",
        "D": "тәрбиелік іс-шара"
      },
      correctAnswer: "C"
    },
    {
      question: "Оқытудың мақсаты:",
      options: {
        "A": "білімді бақылау",
        "B": "жеке тұлғаны дамытудың жоспарланған нәтижесі",
        "C": "жарыс",
        "D": "есеп"
      },
      correctAnswer: "B"
    },
    {
      question: "Тәрбие әдістері - бұл:",
      options: {
        "A": "спорттық жаттығулар",
        "B": "нормативтер",
        "C": "тесттер",
        "D": "педагогикалық ықпал ету тәсілдері"
      },
      correctAnswer: "D"
    },
    {
      question: "Инклюзивті білім беру - бұл:",
      options: {
        "A": "барлық балаларды бірге оқыту",
        "B": "бөлек оқыту",
        "C": "қашықтан оқыту",
        "D": "элиталық оқыту"
      },
      correctAnswer: "A"
    },
    {
      question: "Спортшының мотивациясы - бұл:",
      options: {
        "A": "бақылау",
        "B": "жазалау",
        "C": "нәтижеге жетуге ынталандыру",
        "D": "демалыс"
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогтің көшбасшылық қасиеті мынада көрінеді:",
      options: {
        "A": "авторитарлық басқару",
        "B": "жазалау",
        "C": "бақылау",
        "D": "ұжымға ықпал ете білу"
      },
      correctAnswer: "D"
    }
  ],
  6: [
    {
      question: "Педагогикалық процесте өзінің қабілетін тиімді басқарып, іскерлік пен дағдыны меңгеру жүйесіндегі ұғымды не деп атайды:",
      options: {
        "A": "Дене тәрбиесі.",
        "B": "Дененің дамуы.",
        "C": "Дене тәрбиесінің білімі.",
        "D": "Дене мәдениеті."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене тәрбиесі -- дене мәдениеті мен спорттың мемлекеттік бағдарламасы негізінде іске асырылады.",
      options: {
        "A": "Разрядтық нормалары мен спорт түрлерінің талабы.",
        "B": "Міндеті ғылыми негізделген, дене тәрбиесі құралы, кешенді",
        "C": "Дене тәрбиесі сабақтарының әдістемесі.",
        "D": "Дене тәрбиесі жүйесінің жалпы әлеуметтік-педагогикалық"
      },
      correctAnswer: "B"
    },
    {
      question: "Дене тәрбиесінің арнайы тәсілдеріне жататын:",
      options: {
        "A": "Сөзбен әсер ету, көрнекілік пен іс-тәжірибе жүзінде.",
        "B": "Жедел хабарлау тәсілі.",
        "C": "Іс-тәжірибе, теледидар, өз бетінше жұмыс істеу тәсілі, бақылау,",
        "D": "Қатаң шектелген жаттығулар, ойын және жарыс тәсілдері."
      },
      correctAnswer: "D"
    },
    {
      question: "Абсолюттік күш -- бұл: қимыл-қозғалысында пайда болып, адамның салмағына қарамайды.",
      options: {
        "A": "Максималды күш -- адамның барлық қуатын жұмсағанда",
        "B": "Адамның сыртқы қарсылықтарды жеңу қабілеті.",
        "C": "Статикалық режимде бұлшық ет күшінің максималды түрде көрінуі.",
        "D": "Адамның ерікті белсенділігінен пайда болған күш."
      },
      correctAnswer: "A"
    },
    {
      question: "Арқан бойымен жоғарыдан төмен түскенде:",
      options: {
        "A": "бір қолмен ұстап, екі аяқпен сырғанап төмен түсу керек",
        "B": "оң қолмен қысып ұстап, екі аяқпен сырғанап түсу керек",
        "C": "екі қолмен кезек-кезек ұстап, екі аяқпен демеп түсу керек",
        "D": "екі қолмен қысып ұстап, төмен сырғанау керек"
      },
      correctAnswer: "C"
    },
    {
      question: "Волейболда допты ойынға қосу орны:",
      options: {
        "A": "қарсылас алаңнан",
        "B": "алаңның кез келген жерінен",
        "C": "орталық сызықтан",
        "D": "торға қарап тұрған кезде"
      },
      correctAnswer: "D"
    },
    {
      question: "Қыз балалар секіртпемен бір мезгілде үздіксіз артық жасауға болмайды:",
      options: {
        "A": "90--100 реттен",
        "B": "40--60 реттен",
        "C": "70--80 реттен",
        "D": "110--120 реттен"
      },
      correctAnswer: "A"
    },
    {
      question: "Волейболда тордың биіктігі 2 м 35 см болатын ер балалардың жасы:",
      options: {
        "A": "15--16 жас",
        "B": "19--20 жас",
        "C": "13--14 жас",
        "D": "17--18 жас"
      },
      correctAnswer: "A"
    },
    {
      question: "Қозғалмалы ойындардың негізгі топтары",
      options: {
        "A": "эстафеталық ойындар",
        "B": "жарыс, рөлдік және эстафеталық",
        "C": "жеке және топтық",
        "D": "жарыс және логикалық ойындар"
      },
      correctAnswer: "B"
    },
    {
      question: "Жүзіу мен сүңгу тәсілдері жатады",
      options: {
        "A": "спорттық жүзуге",
        "B": "еркін жүзу, шалқалап жүзу",
        "C": "қолданбалы жүзуге",
        "D": "мұнарадан секіру"
      },
      correctAnswer: "C"
    },
    {
      question: "Волейбол ойын барысында «либероның» әрекеті",
      options: {
        "A": "артқы сызықта ойнайтын қорғаушы",
        "B": "тосқауылда қимыл-әрекет жасайды",
        "C": "шабуылшы ойыншы",
        "D": "алдыңғы сызықта ойнайды"
      },
      correctAnswer: "A"
    },
    {
      question: "Жүзушілердің 25 метрден 1500 метрге дейінгі қашықтықтағы рекордтық көрсеткіштері жүзудің осы түрінен орындалған",
      options: {
        "A": "Шалқалап жүзу",
        "B": "Брасс әдісі",
        "C": "Дельфин әдісі",
        "D": "Кроль әдісі"
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда доға радиусы",
      options: {
        "A": "6,20",
        "B": "5,25",
        "C": "6,30",
        "D": "6,25"
      },
      correctAnswer: "D"
    },
    {
      question: "Неліктен АТФ қайта түзілуінің фосфат жүйесі анаэробты және алактатты деп аталады?",
      options: {
        "A": "Ол оттегінің ең аз мөлшерін қажет етеді және аз лактат түзеді.",
        "B": "Энергия көзі ретінде тек майларды пайдаланады.",
        "C": "Ол оттегін қажет етпейді және сүт қышқылының түзілуімен бірге жүрмейді.",
        "D": "Бұлшықеттерде лактаттың жиналуымен байланысты."
      },
      correctAnswer: "C"
    },
    {
      question: "Орталық қан түзетін ағзаларға жаттатындар:",
      options: {
        "A": "Миндалиналар",
        "B": "тимус",
        "C": "көкбауыр",
        "D": "бауыр"
      },
      correctAnswer: "B"
    },
    {
      question: "Спорттық биомеханикадағы кинематикалық талдау әдісі нені қамтиды?",
      options: {
        "A": "Денеге әсер ететін күштерді бағалау",
        "B": "Бұлшықеттердің электрлік белсенділігін тіркеу",
        "C": "Жарақатты болжау",
        "D": "Орын ауыстыруды, жылдамдықты және үдеуді өлшеу"
      },
      correctAnswer: "D"
    },
    {
      question: "Тыныс алу актісіндегі диафрагманың рөлін ең дәл сипаттайтын тұжырым:",
      options: {
        "A": "Тыныс алудағы негізгі тыныс бұлшықеті болып табылады",
        "B": "Тек форсирленген тыныс алуға қатысады",
        "C": "Пассивті тыныс шығаруды қамтамасыз етеді",
        "D": "Тек физикалық жүктеме кезінде ғана жұмыс істейді"
      },
      correctAnswer: "A"
    },
    {
      question: "Гематокрит -- бұл:",
      options: {
        "A": "Тығыз қан шөгіндісі",
        "B": "Қанның түстік көрсеткіші",
        "C": "Қанның жалпы көлеміндегі эритроциттердің көлемінің пайызы",
        "D": "Қанның барлық элементтері"
      },
      correctAnswer: "C"
    },
    {
      question: "Балалардың сүйек тіні:",
      options: {
        "A": "Неғұрлым жіңішке",
        "B": "Құрамында органикалық заттар жоқ",
        "C": "Сүйек үсті жоқ",
        "D": "Неғұрлым икемді"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогикалық процесс - бұл:",
      options: {
        "A": "возможности и пути обучения",
        "B": "жаттығу әдістері",
        "C": "оқыту мен тәрбиелеудің тұтас жүйесі",
        "D": "білімді бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Құзыреттілікке негізделген тәсілдеме:",
      options: {
        "A": "мәтінді жаттап алу",
        "B": "практикалық білік пен дағдыларды қалыптастыру",
        "C": "тәртіпті бақылау",
        "D": "жүктемені арттыру"
      },
      correctAnswer: "B"
    },
    {
      question: "Өзін-өзі тәрбиелеу - бұл:",
      options: {
        "A": "жазалау",
        "B": "бақылау",
        "C": "емтихан",
        "D": "тұлғаның өзімен саналы түрде жұмыс істеуі"
      },
      correctAnswer: "D"
    },
    {
      question: "ЕБҚ бар балалар - бұл:",
      options: {
        "A": "ерекше білім беру қажеттіліктері бар білім алушылар",
        "B": "тек спортшылар",
        "C": "үздік оқушылар",
        "D": "тәртіп бұзушылар"
      },
      correctAnswer: "A"
    },
    {
      question: "Спорттың тәрбиелік әлеуеті мыналардан көрінеді:",
      options: {
        "A": "тек дене дамуы",
        "B": "бақылау",
        "C": "тәртіп пен жауапкершілікті қалыптастыру",
        "D": "есептілік"
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогикалық мәдениет дегеніміз:",
      options: {
        "A": "жұмыс өтілі",
        "B": "сыртқы келбеті",
        "C": "лауазымы",
        "D": "кәсіби білім, білік және құндылықтардың жиынтығы"
      },
      correctAnswer: "D"
    }
  ],
  7: [
    {
      question: "Адам денесін жетілдіруге, құралдары мен тәсілдерін тиімді пайдалануға бағытталған қоғам жетістіктерінің жиынтығын не деп атайды:",
      options: {
        "A": "Спорт.",
        "B": "Дене мәдениетінің базасы.",
        "C": "Дене мәдениеті.",
        "D": "Бейімделу дене мәдениеті."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене мәдениеті мен спорттағы білімнің көрінуі: беру.",
      options: {
        "A": "Спорттық және арнайы физкультуралық білімді қалыптастыру.",
        "B": "Оқушыларға қозғалыс іскерлігі мен дағдысы және онымен қоса білім",
        "C": "Адам организмінің жан-жақты түрі мен функциясын дамыту.",
        "D": "Жеке адамды жан-жақты дамыту."
      },
      correctAnswer: "B"
    },
    {
      question: "Үздіксіз және интервалды жаттығуларды орындауда қай тәсіл пайдаланылады?",
      options: {
        "A": "Ілесімді әсер етуші тәсіл.",
        "B": "Ойын тәсілі.",
        "C": "Ауыспалы-үзіліссіз жаттығулар тәсілі.",
        "D": "Айналмалы тәсіл."
      },
      correctAnswer: "D"
    },
    {
      question: "Салыстырмалы күш -- бұл:",
      options: {
        "A": "Адамның 1 кг салмағына есептегендегендегі күш.",
        "B": "Бір адамның күшін екінші адамның күшімен салыстыру.",
        "C": "Бұлшық еттің 1 см кесіндісіндегі күш.",
        "D": "Бір жаттығуды орындағанда екінші жаттығумен салыстыру."
      },
      correctAnswer: "A"
    },
    {
      question: "Уақытты есептеп, аралас асылудан үш тәсілмен өрмелеу арқанының биіктігі (қыз балалар үшін):",
      options: {
        "A": "2 метр",
        "B": "5 метр",
        "C": "3 метр",
        "D": "4 метр"
      },
      correctAnswer: "C"
    },
    {
      question: "Футболда шабуылшының басты мақсаты:",
      options: {
        "A": "допты ұстау, қорғану",
        "B": "қарсылас ойыншыны алдау",
        "C": "ойын ережелерін сақтау",
        "D": "допты қақпаға енгізу"
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда қолында добы бар ойыншы секіру кезінде жіберетін қателігі:",
      options: {
        "A": "секіріп допты екі қолмен кеудеден торға лақтыру",
        "B": "секіріп доппен қайта жерге түсу",
        "C": "секіріп допты әріптесіне бір қолмен иықтан беру",
        "D": "секіріп допты бір қолмен торға лақтыру"
      },
      correctAnswer: "B"
    },
    {
      question: "Волейболда тордың биіктігі 2 м 20 см болатын қыз балалардың жасы:",
      options: {
        "A": "15--16 жас",
        "B": "17--18 жас",
        "C": "13--14 жас",
        "D": "19--20 жас"
      },
      correctAnswer: "A"
    },
    {
      question: "Бір лекті саптан екі лекті сапты құру үшін берілетін пәрмен (команда)",
      options: {
        "A": "екі сапқа тұр",
        "B": "екі лекке тұр",
        "C": "екі қатарға тұр",
        "D": "сапқа тұр"
      },
      correctAnswer: "B"
    },
    {
      question: "Жүгіріп келіп ұзындыққа секірер алдында",
      options: {
        "A": "құрал-жабдықтардың тот баспауын қадағалау керек",
        "B": "құрал-жабдықтарды жүгіретін жолға қою керек",
        "C": "шұңқырдағы құмды қопсытып алу керек",
        "D": "снарядтардың бекітілуін мұқият тексеру керек"
      },
      correctAnswer: "C"
    },
    {
      question: "Тордың алдыңғы сызығында тұратын позициялық нөмірлер",
      options: {
        "A": "2, 3, 4",
        "B": "1, 2, 3",
        "C": "1, 5, 6",
        "D": "2, 4, 6"
      },
      correctAnswer: "A"
    },
    {
      question: "1 метр биіктіктен суға секіру үшін судың тереңдігі кем болмауы керек",
      options: {
        "A": "1 метрден",
        "B": "3 метрден",
        "C": "1,5 метрден",
        "D": "2 метрден"
      },
      correctAnswer: "A"
    },
    {
      question: "Волейбол ойын барысында «либероның» әрекеті",
      options: {
        "A": "артқы сызықта ойнайтын қорғаушы",
        "B": "тосқауылда қимыл-әрекет жасайды",
        "C": "шабуылшы ойыншы",
        "D": "алдыңғы сызықта ойнайды"
      },
      correctAnswer: "A"
    },
    {
      question: "Неліктен қан спорттағы ең ақпараттық биохимиялық зерттеу нысандарының бірі болып табылады?",
      options: {
        "A": "Себебі қан анализін алу оңай.",
        "B": "Қан тек аурулармен өзгереді.",
        "C": "Қан ағзаның тіндері мен ішкі ортасында болатын метаболикалық өзгерістерді көрсетеді.",
        "D": "Ол тек жүрек-тамыр жүйесінің күйін сипаттайды."
      },
      correctAnswer: "C"
    },
    {
      question: "Сүйектің сары кемігі қайда орналасады;",
      options: {
        "A": "Қабырға сүйектерінде",
        "B": "Түтікшелі сүйектерінің диафизінде",
        "C": "Түтікшелі сүйектерінің эпифизінде",
        "D": "омыртқа сүйектерінде"
      },
      correctAnswer: "B"
    },
    {
      question: "Электрлік тензометрия нені өлшейді?",
      options: {
        "A": "Ағзадағы температураның өзгеруін",
        "B": "Бұлшықеттердің электрлік белсенділігін",
        "C": "Дененің қозғалыс жылдамдығын",
        "D": "Дене бетінің деформациясын"
      },
      correctAnswer: "D"
    },
    {
      question: "Төзімділікке бағытталған спорт түрлерімен айналысатын спортшыларда сыртқы тыныстың функционалдық жағдайын бағалауда ең ақпаратты тыныс алу тесті:",
      options: {
        "A": "Спирометрия (Өкпенің тіршілік сыйымдылығы ӨТС, Форсирленген өкпенің тіршілік сыйымдылығы ФӨТС)",
        "B": "Тыныс алу жиілігі (тыныштықта)",
        "C": "Тынысты барынша ұстап тұру сынамасы, физиологиялық тыныс алу сынамалары",
        "D": "Кеуде қуысының экскурсиясы"
      },
      correctAnswer: "A"
    },
    {
      question: "Тыныш дем шығару кезінде қабырғаның көлемі кішірейеді:",
      options: {
        "A": "Іш бұлшықеттерінің жиырылуына байланысты",
        "B": "Мойын бұлшықеттерінің жиырылуына байланысты",
        "C": "Қабырға аралық бұлшықеттер мен диафрагманың жиырылуына байланысты",
        "D": "Іштің бұлшық еттеріне байланысты"
      },
      correctAnswer: "C"
    },
    {
      question: "Омыртқаның бүгілуін қалыптастыру:",
      options: {
        "A": "1 жылға қарай",
        "B": "3 жасқа",
        "C": "7 жасқа",
        "D": "Жасөспірім жасына қарай"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогикалық процестің заңдылықтары нені көрсетеді:",
      options: {
        "A": "кездейсоқ құбылыстарды",
        "B": "әкімшілік талаптарын",
        "C": "оның құрамдас бөліктері арасындағы тұрақты байланыстарды",
        "D": "сабақ кестесін"
      },
      correctAnswer: "C"
    },
    {
      question: "Оқыту әдісі - бұл:",
      options: {
        "A": "сабақ кестесі",
        "B": "мұғалім мен оқушының бірлескен іс-әрекеті",
        "C": "есеп",
        "D": "бақылау түрі"
      },
      correctAnswer: "B"
    },
    {
      question: "Кәсіби құзыреттілік - бұл:",
      options: {
        "A": "жұмыс өтілі",
        "B": "диплом алу",
        "C": "жарыстарға қатысу",
        "D": "білім, білік және жеке қасиеттердің жиынтығы"
      },
      correctAnswer: "D"
    },
    {
      question: "Бағдарламаны бейімдеу - бұл:",
      options: {
        "A": "баланың мүмкіндіктерін ескере отырып, оқу мазмұнын өзгерту",
        "B": "оқытуды тоқтату",
        "C": "талаптарды төмендету",
        "D": "білім алушылардың білімін толықтыру"
      },
      correctAnswer: "A"
    },
    {
      question: "Бапкердің өзін-өзі талдауы - бұл:",
      options: {
        "A": "спортшыларды бақылау",
        "B": "жарыс",
        "C": "өзінің кәсіби қызметін бағалау",
        "D": "емтихан"
      },
      correctAnswer: "C"
    },
    {
      question: "Педагогтың этикасы дегеніміз:",
      options: {
        "A": "жарыс ережелері",
        "B": "оқыту әдісі",
        "C": "бақылау формасы",
        "D": "кәсіби мінез-құлық нормалары"
      },
      correctAnswer: "D"
    }
  ],
  8: [
    {
      question: "Дене мәдениетінің сауықтыру-реабилитациясы дегеніміз:",
      options: {
        "A": "Бос уақытты ұйымдастыру ортасында.",
        "B": "Мектептегі дене тәрбиесі сабағында.",
        "C": "Әлеуметтік қалыпқа келтіру жүйесінде.",
        "D": "Спорттық жаттығуда."
      },
      correctAnswer: "C"
    },
    {
      question: "Аталған қағидалардың ішіндегі жалпы әдістемелік қағиданы көрсет:",
      options: {
        "A": "Үздіксіздік қағидасы, демалу мен ауыртпалықтың жүйелі түрде",
        "B": "Саналылық пен белсенділік, көрнекілік, қол жетерлік және жеке",
        "C": "Динамикалық ауыртпалықтың бейімделу теңдігі, циклдық сабақты құру",
        "D": "Даму -- жаттығу әсерін біртіндеп өсіру қағидасы, дене тәрбиесінің"
      },
      correctAnswer: "B"
    },
    {
      question: "Дене тәрбиесі қандай жалпы педагогикалық тәсілдерге жатады:",
      options: {
        "A": "Қатаң шектелген жаттығулар тәсілі, ойын-жарыс тәсілі.",
        "B": "Жылдамдату-хабарлау тәсілі.",
        "C": "Тәжірибе тәсілі, теледидар, өзінше жұмыс істеу, бақылау, өзін-өзі",
        "D": "Сөзбен әсер ету тәсілі мен көрнекілік тәсілі."
      },
      correctAnswer: "B"
    },
    {
      question: "Жаттықтыру сабағындағы жүктемені қандай әдіспен анықтауға болады:",
      options: {
        "A": "Тамыр соғу өлшемі.",
        "B": "Педагогикалық талдау.",
        "C": "Хронометраж.",
        "D": "Педагогикалық бақылау."
      },
      correctAnswer: "D"
    },
    {
      question: "Баскетболда алаңда бір командада ойнайтын ойыншылардың саны:",
      options: {
        "A": "6",
        "B": "4",
        "C": "5",
        "D": "7"
      },
      correctAnswer: "A"
    },
    {
      question: "Оқушылардың бірінің артынан бірі тұруы:",
      options: {
        "A": "сап",
        "B": "шеңбер",
        "C": "қатар",
        "D": "лек (тізбек)"
      },
      correctAnswer: "C"
    },
    {
      question: "Қозғалу техникасы (гандбол):",
      options: {
        "A": "ұстау",
        "B": "бұрылыстар",
        "C": "қағу",
        "D": "лақтыру"
      },
      correctAnswer: "D"
    },
    {
      question: "Волейболда тордың биіктігі 2 м 24 см қай жастағы қыздарға арналған:",
      options: {
        "A": "17--18 жас",
        "B": "13--14 жас",
        "C": "15--16 жас",
        "D": "11--12 жас"
      },
      correctAnswer: "B"
    },
    {
      question: "Адамның белгілі бір уақыт аралығында кеңістіктегі қозғалған әрекеті",
      options: {
        "A": "күш",
        "B": "жылдамдық",
        "C": "төзімділік",
        "D": "ептілік"
      },
      correctAnswer: "C"
    },
    {
      question: "Қол добында ойыншы допты қолында ұстау уақыты",
      options: {
        "A": "7 секунд",
        "B": "9 секунд",
        "C": "3 секунд",
        "D": "5 секунд"
      },
      correctAnswer: "B"
    },
    {
      question: "Классикалық шаңғы жүрісі",
      options: {
        "A": "алма-кезек екі адымдап",
        "B": "жүгіріп адымдап",
        "C": "шаңғысыз жүріс",
        "D": "қос аяқпен адымдап"
      },
      correctAnswer: "C"
    },
    {
      question: "Баскетбол ойыны тұратын кезең",
      options: {
        "A": "3",
        "B": "2",
        "C": "1",
        "D": "4"
      },
      correctAnswer: "A"
    },
    {
      question: "Дене тәрбиесі жүйесінің сипаты: ұйымдастыру негізі.",
      options: {
        "A": "Дене тәрбиесінің қағидалары, мақсаты, міндеті.",
        "B": "Ғылыми-әдістемелік, бағдарлы нормативті және дене тәрбиесінің",
        "C": "Функциялық жүйесінің жағдайы.",
        "D": "Дене тәрбиесінің бағдары-нормативі."
      },
      correctAnswer: "D"
    },
    {
      question: "Неліктен дегидратация әсіресе физикалық жүктеме кезінде қауіпті?",
      options: {
        "A": "Өйткені ол тек тыныс алу жүйесінің жұмысына әсер етеді.",
        "B": "Себебі ол АТФ синтезін күшейтеді.",
        "C": "Өйткені су терморегуляцияға, қоректік заттарды тасымалдауға және метаболизм өнімдерін жоюға қатысады.",
        "D": "Өйткені бұлшықеттердің серпімділігін арттырады."
      },
      correctAnswer: "C"
    },
    {
      question: "Орталық эндокринді жүйеге қатысты ағза:",
      options: {
        "A": "қалқанша безі",
        "B": "Гипоталамус",
        "C": "Буйрек үсті бездері",
        "D": "қос қалқанша безі"
      },
      correctAnswer: "B"
    },
    {
      question: "Вектординамография арқылы қандай қозғалыстарды талдауға болады?",
      options: {
        "A": "Тыныштық күйіндегі дене тербелістерін",
        "B": "Бұлшықет кернеуін",
        "C": "Тербеліс амплитудасын",
        "D": "Қозғалыстың бағыты мен күшін"
      },
      correctAnswer: "D"
    },
    {
      question: "Жүктеме кезінде минуттық тыныс алу көлемі артып, бірақ альвеолярлық вентиляция ұлғаймаса, бұл нені көрсетеді?",
      options: {
        "A": "«өкпенің өлі кеңістіктің» ұлғаюын",
        "B": "Тыныс алу жүйесінің жоғары тиімділігін",
        "C": "Тыныс алудың оңтайлы реттелуін",
        "D": "Аэробтық жұмысқа бейімделуді"
      },
      correctAnswer: "A"
    },
    {
      question: "Өкпе қан айналымы басталады:",
      options: {
        "A": "Қолқа",
        "B": "қуыс вена",
        "C": "Өкпе діңі",
        "D": "Капиллярлар"
      },
      correctAnswer: "C"
    },
    {
      question: "Егде жаста жиі дамиды:",
      options: {
        "A": "Гипертрофия",
        "B": "Сколиоз",
        "C": "Миозит",
        "D": "Остеопороз"
      },
      correctAnswer: "D"
    },
    {
      question: "Гумандық қағидасы мынаны білдіреді:",
      options: {
        "A": "қатаң тәртіп",
        "B": "жазалау",
        "C": "білім алушының тұлғасына құрметпен қарау",
        "D": "бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Оқытудың белсенді әдістері мыналарды қамтиды:",
      options: {
        "A": "пассивті тыңдау",
        "B": "білім алушылардың танымдық іс-әрекетке қатысуы",
        "C": "жазалау әдістері",
        "D": "бақылау әдістері"
      },
      correctAnswer: "B"
    },
    {
      question: "Педагогикалық шеберлік - бұл:",
      options: {
        "A": "тәрбие әдістерін қолдану",
        "B": "бақылау әдістерін күшейту",
        "C": "жазалау әдістерін жиі қолдану",
        "D": "кәсіби іс-әрекеттің жоғары деңгейі"
      },
      correctAnswer: "D"
    },
    {
      question: "Инклюзивті мәдениет - бұл:",
      options: {
        "A": "әртүрлілікті құрметтеу және қабылдау",
        "B": "жарыс",
        "C": "бақылау",
        "D": "оқшаулау"
      },
      correctAnswer: "A"
    },
    {
      question: "Жүйелілік принципі мынаны білдіреді:",
      options: {
        "A": "сабақтарды қалауы бойынша өткізу",
        "B": "оқытудың кездейсоқ (эпизодтық) сипаты",
        "C": "педагогикалық жұмыстың тұрақтылығы мен жүйелілігі",
        "D": "жүктеменің артуы"
      },
      correctAnswer: "C"
    },
    {
      question: "Қақтығыс дегеніміз:",
      options: {
        "A": "жарыс",
        "B": "пікірталас",
        "C": "ынтымақтастық",
        "D": "қарама-қайшы мүдделердің қақтығысы"
      },
      correctAnswer: "D"
    }
  ],
  9: [
    {
      question: "Философия ғылымындағы тәсілдерді тану мен болмысты өзгерту, дүниетануда принциптерді қолдануды не деп атайды:",
      options: {
        "A": "Әдістеме.",
        "B": "Әдістемелік тәсіл.",
        "C": "Әдіснама.",
        "D": "Әдіс."
      },
      correctAnswer: "C"
    },
    {
      question: "Қандай қағида шұғылданушылардың мүмкіншілігіне қарай дене тәрбиесінің тиімді тапсырмаларымен құралы, тәсілін қарастырады:",
      options: {
        "A": "Саналылық пен белсенділік қағидасы.",
        "B": "Қол жетерлік және жеке-дара қағидасы.",
        "C": "Ғылымилық қағидасы.",
        "D": "Ілім мен тәжірибенің байланыс қағидасы."
      },
      correctAnswer: "B"
    },
    {
      question: "Мақсатты, жүйелі, қалыптасу процесін қалыптастыру мен дамытуды қандай әлеуметтік субъекті түрде жүргізіледі:",
      options: {
        "A": "Оқу.",
        "B": "Оқыту.",
        "C": "Тәрбиелеу.",
        "D": "Үйрету."
      },
      correctAnswer: "C"
    },
    {
      question: "Ауыр емес салмақты, шаршағанша көтеру қайсысына жатады:",
      options: {
        "A": "«Төзімділік» күш тәрбиелеу тәсілі.",
        "B": "«Қарқында» күш тәрбиелеу тәсілі.",
        "C": "Бұлшық еттің «қопарғыш» күшін тәрбиелеу.",
        "D": "«Берілу» режимінде бұлшық ет күшін тәрбиелеу."
      },
      correctAnswer: "A"
    },
    {
      question: "Бұл әдіспен көтерілу тік беткейге шыққанда қолданылады:",
      options: {
        "A": "жартылай шырша әдісі",
        "B": "соқа әдісі",
        "C": "баспалдақ әдісі",
        "D": "шырша әдісі"
      },
      correctAnswer: "C"
    },
    {
      question: "Суда етпеттеп жатып, екі қолмен суды күрей, кейін қарай серпиді. Қол мен аяқ бірдей жұмыс істейтін әдіс:",
      options: {
        "A": "брасс әдісі",
        "B": "кроль әдісі",
        "C": "шалқалап жүзу",
        "D": "дельфин әдісі"
      },
      correctAnswer: "A"
    },
    {
      question: "Орнында тұрып бұрылу, оңға, оңға кері айналу, солға, солға кері айналу, бір аяқпен тепе-теңдік сақтау орындалады:",
      options: {
        "A": "арқанда",
        "B": "бөренеде",
        "C": "белтемірде",
        "D": "сырықта"
      },
      correctAnswer: "A"
    },
    {
      question: "Волейболда тордың биіктігі 2 м 43 см болатын ер балалардың жасы:",
      options: {
        "A": "17--18 жас",
        "B": "13--14 жас",
        "C": "15--16 жас",
        "D": "11--12 жас"
      },
      correctAnswer: "A"
    },
    {
      question: "Саптық жаттығулардың топқа бөлінуі жүгіру, жайылу және сығылу",
      options: {
        "A": "сапқа тұру және сап өзгертіп тұру, жүру және жүгіру, секіру",
        "B": "саптық тәсілдер, сапқа тұру және сапты өзгерту, жүру және",
        "C": "саптық тәсілдер, сапқа тұру және өзгертіп тұру, жүгіру",
        "D": "саптық тәсілдер, сапты өзгертіп тұру, жүру, секіру"
      },
      correctAnswer: "A"
    },
    {
      question: "Қозғалмалы ойындардағы техника қауіпсіздігінің шарттары",
      options: {
        "A": "қарсыласына шабуыл жасау",
        "B": "тек жылдам ойнау",
        "C": "нұсқауды орындау",
        "D": "ойын ережелерін елемеу"
      },
      correctAnswer: "B"
    },
    {
      question: "Өрге шығу әдістері",
      options: {
        "A": "шырша әдісі",
        "B": "сүйеніш әдісі",
        "C": "қос аяқпен секіру әдісі",
        "D": "соқа әдісі"
      },
      correctAnswer: "C"
    },
    {
      question: "Волейбол командасының ойыншылар құрамы",
      options: {
        "A": "11 ойыншы (5 қосалқы, 6 негізгі)",
        "B": "16 ойыншы (6 негізгі, 10 қосалқы)",
        "C": "14 ойыншы (6 негізгі, 8 қосалқы)",
        "D": "12 ойыншы (6 қосалқы, 6 негізгі)"
      },
      correctAnswer: "A"
    },
    {
      question: "Тәсіл бір аяқ алға қойылған, дененің салмағы екі аяққа бірдей түскен, кеуде допты лақтыратын қолға қарай аздап еңкейген қалыпта орындалады (гандбол):",
      options: {
        "A": "жоғарыдан беру",
        "B": "қолдың арасынан беру",
        "C": "астынан беру",
        "D": "бүйірден беру"
      },
      correctAnswer: "D"
    },
    {
      question: "Жаттығу кезінде шамалы дегидратация кезінде де қандай салдары болуы мүмкін?",
      options: {
        "A": "Аэробты өнімділікті арттыру.",
        "B": "Қозғалыстарды үйлестіруді жақсарту.",
        "C": "Төзімділік пен өнімділіктің төмендеуі.",
        "D": "Қалпына келтіру процестерін жеделдету."
      },
      correctAnswer: "C"
    },
    {
      question: "Эндокринді бездерінің қызметін үнемі реттеп отыратын жүйе қайсысы:",
      options: {
        "A": "Ас қорыту",
        "B": "жүйке",
        "C": "тыныс алу",
        "D": "жүйке"
      },
      correctAnswer: "B"
    },
    {
      question: "Денеге күш әсер етпесе, оның тыныштық күйін немесе бірқалыпты қозғалысын сақтайтынын қандай заң түсіндіреді?",
      options: {
        "A": "Ньютонның екінші заңы",
        "B": "Импульстің сақталу заңы",
        "C": "Энергияның сақталу заңы",
        "D": "Ньютонның бірінші заңы"
      },
      correctAnswer: "D"
    },
    {
      question: "Спортшының тыныштықтағы жүрек соғу жиілігі -- 48 рет/мин. Стандартты жүктемеден кейін пульс 2 минутта бастапқы деңгейіне келді. Бұл нені білдіреді?",
      options: {
        "A": "Жүрек-қантамыр жүйесінің функционалдық жағдайының жоғары деңгейі",
        "B": "Жаттығу деңгейінің жеткіліксіздігі, ырғақтың бұзылуы",
        "C": "Жүрек ырғағын реттеудің бұзылуы",
        "D": "Патологиялық брадикардия, артериялық қысымның төмендеуі"
      },
      correctAnswer: "A"
    },
    {
      question: "Ересек адамның қанының көлемі қанша литр?",
      options: {
        "A": "3 литр",
        "B": "6 л",
        "C": "5 литр",
        "D": "2 литр"
      },
      correctAnswer: "C"
    },
    {
      question: "Бұлшық еттердің тұрақты жүктемесі кезінде:",
      options: {
        "A": "Атрофияланады",
        "B": "Кішірейтіледі",
        "C": "Икемділігін жоғалтады",
        "D": "Гипертрофияланады"
      },
      correctAnswer: "D"
    },
    {
      question: "Әлеуметтену - бұл:",
      options: {
        "A": "спорттық дайындық",
        "B": "аттестаттау",
        "C": "әлеуметтік нормалар мен құндылықтарды меңгеру",
        "D": "жарыс"
      },
      correctAnswer: "C"
    },
    {
      question: "Сабақ - бұл:",
      options: {
        "A": "жарыс",
        "B": "оқытуды ұйымдастырудың негізгі формасы",
        "C": "факультатив",
        "D": "семинар"
      },
      correctAnswer: "B"
    },
    {
      question: "Педагогикалық қарым-қатынас - бұл:",
      options: {
        "A": "ата-аналармен жүргізілетін жұмыстар",
        "B": "жарыстарға білім алушыларды қатыстыру",
        "C": "бақылау әдістерін жиі қолдану",
        "D": "педагог пен білім алушылардың кәсіби өзара іс-әрекеті"
      },
      correctAnswer: "D"
    },
    {
      question: "Инклюзиядағы педагогтың рөлі - бұл:",
      options: {
        "A": "барлық білім алушылар үшін қолайлы орта құру",
        "B": "бақылау",
        "C": "тәртіп",
        "D": "бағалау"
      },
      correctAnswer: "A"
    },
    {
      question: "Көрнектілік принципі мынаған негізделеді:",
      options: {
        "A": "мысалсыз ауызша түсіндіру",
        "B": "білімді бақылау",
        "C": "визуалды құралдар мен көрсетілімдерді қолдану",
        "D": "өзіндік жұмыс"
      },
      correctAnswer: "C"
    },
    {
      question: "Қақтығысты шешу мынаны білдіреді:",
      options: {
        "A": "елемеу",
        "B": "жазалау",
        "C": "қысым көрсету",
        "D": "конструктивті диалог жүргізу және ымыраға келу жолын табу"
      },
      correctAnswer: "D"
    }
  ],
  10: [
    {
      question: "Дене мәдениеті мен спорттағы ғылыми жұмысты жүргізу түрлерінің жиынтығын қалай атаймыз:",
      options: {
        "A": "Әдіс.",
        "B": "Әдістемелік тәсіл.",
        "C": "Әдістеме.",
        "D": "Заңдылық."
      },
      correctAnswer: "C"
    },
    {
      question: "Қандай қағида ағзаның жұмыс істеу деңгейі өскен сайын ауыртпалықтың көлемі мен қарқыны жоспарлы түрде өсуін қарастырады:",
      options: {
        "A": "Ғылымилық қағида.",
        "B": "Біртіндеп өсіріп, дамытып жаттықтыру қағидасы.",
        "C": "Қол жетерлік және даралық қағидасы.",
        "D": "Үздіксіздік қағидасы."
      },
      correctAnswer: "B"
    },
    {
      question: "Қимыл-қозғалысты игерудің дұрыс үлгісін тап:",
      options: {
        "A": "Іскерлік -- іскерлікке дейін -- дағды.",
        "B": "Дағды -- іскерлік -- іскерлікке дейін.",
        "C": "Дағды -- іскерлікке дейін -- іскерлік.",
        "D": "Іскерлікке дейін -- іскерлік -- дағды."
      },
      correctAnswer: "D"
    },
    {
      question: "Бұлшық ет топтарындағы абсолютті күштің өсу қарқыны қай топта байқалады:",
      options: {
        "A": "Жоғары сынып оқушылары 16--18 жас.",
        "B": "Мектепке дейінгі 5--6 жас.",
        "C": "Бастапқы сынып оқушылары 9--11 жас.",
        "D": "Орта сынып оқушылары 12--15 жас."
      },
      correctAnswer: "A"
    },
    {
      question: "Суда дене тоңазып, мұздағандай болса:",
      options: {
        "A": "судан басты ғана шығарып отыру керек",
        "B": "тез арада суға сүңгу керек",
        "C": "судан шығып жаттығулар орындау керек",
        "D": "судың ішінде жаттығу жасау керек"
      },
      correctAnswer: "C"
    },
    {
      question: "Футболда ортадан допты қосу анықталады:",
      options: {
        "A": "команда капитандары",
        "B": "жанкүйерлер анықтайды",
        "C": "айып добы арқылы",
        "D": "жеребе арқылы"
      },
      correctAnswer: "D"
    },
    {
      question: "Өрге шығудың бұл тәсілінде бір шаңғы өрге тура бағытталған, ал екінші шаңғының басы сыртқа қиғаш қараған қалыпта болады:",
      options: {
        "A": "баспалдақ тәсілі",
        "B": "жартылай шырша әдісі",
        "C": "соқа тәсілі",
        "D": "шырша әдісі"
      },
      correctAnswer: "B"
    },
    {
      question: "Волейболда ортадағы сызық белдеуінен 3 м қашықтықта жүргізіледі:",
      options: {
        "A": "шабуылдау сызығы",
        "B": "допты ойынға қосатын аймақ",
        "C": "қорғану аймағы",
        "D": "еркін аймақ"
      },
      correctAnswer: "A"
    },
    {
      question: "Шалқадан жатып, аяқты жоғары серпіп көтеріп, қолды белге ұстап, шынтақты жерге тірей қою",
      options: {
        "A": "көпір жасау",
        "B": "жауырынмен тұру",
        "C": "алға домалау",
        "D": "артқа домалау"
      },
      correctAnswer: "A"
    },
    {
      question: "Уақытты есептеп, аралас асылудан үш тәсілмен өрмелеу арқанның биіктігі (ер балалар үшін)",
      options: {
        "A": "2 метр",
        "B": "5 метр",
        "C": "4 метр",
        "D": "3 метр"
      },
      correctAnswer: "B"
    },
    {
      question: "Шаңғы спорты. Тоқтау әдісі",
      options: {
        "A": "соқа әдісі",
        "B": "сатылау әдісі",
        "C": "жартылай шырша әдісі",
        "D": "шырша әдісі"
      },
      correctAnswer: "D"
    },
    {
      question: "Қол добы ойынын кім ойлап тапқан?",
      options: {
        "A": "Леонардо да Винчи",
        "B": "Дэвид Блоутон",
        "C": "Джеймс Нейсмит",
        "D": "Хольгер Нильсен"
      },
      correctAnswer: "A"
    },
    {
      question: "Волейболда тордың биіктігі 2 м 35 см болатын ер балалардың жасы:",
      options: {
        "A": "15--16 жас",
        "B": "19--20 жас",
        "C": "13--14 жас",
        "D": "17--18 жас"
      },
      correctAnswer: "D"
    },
    {
      question: "Денедегі электролиттердің негізгі функцияларының бірі қандай?",
      options: {
        "A": "Митохондриядағы АТФ синтезін қамтамасыз ету.",
        "B": "Тек ақуыз алмасуын реттеу.",
        "C": "Жасушалардың су балансын сақтау.",
        "D": "Сүйек тінінің қалыптасуы."
      },
      correctAnswer: "C"
    },
    {
      question: "Тыныс алу жүйесінің түтікше мүшесінің қайсысының талшықты шеміршекті қабығында 16-20 гиалінді шеміршекті жартылай сақинашықтары болады:",
      options: {
        "A": "көмекей",
        "B": "Кеңірдек",
        "C": "басты бронх",
        "D": "ірі бронх"
      },
      correctAnswer: "B"
    },
    {
      question: "Биіктікке секіру кезінде спортшы қандай энергияны пайдаланады?",
      options: {
        "A": "Жылулық энергия",
        "B": "Электр энергиясы",
        "C": "Потенциалдық энергия",
        "D": "Кинетикалық энергия"
      },
      correctAnswer: "D"
    },
    {
      question: "Оң және сол өкпе арасындағы дұрыс анатомо-топографиялық айырмашылық:",
      options: {
        "A": "Оң өкпе сол өкпеге қарағанда қысқалау және кеңдеу",
        "B": "Оң өкпе -- екі бөлікті, сол өкпе -- үш бөлікті",
        "C": "Сол өкпе оң өкпеге қарағанда кең",
        "D": "Сол өкпе тыныс алуға қатыспайды"
      },
      correctAnswer: "A"
    },
    {
      question: "Адам күніне келесі грамм көмірсуларды тұтынуы керек:",
      options: {
        "A": "100",
        "B": "800",
        "C": "400",
        "D": "550"
      },
      correctAnswer: "C"
    },
    {
      question: "Спортшыларда жиі жарақат алады:",
      options: {
        "A": "Сүйек үсті",
        "B": "Сүйек кемігі",
        "C": "Құймышақ",
        "D": "Байламдар"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогикалық іс-әрекет - бұл:",
      options: {
        "A": "төрешілік қызмет",
        "B": "менеджмент",
        "C": "оқыту мен тәрбиелеуді жүзеге асыруға бағытталған кәсіби іс-әрекет",
        "D": "медициналық сүйемелдеу"
      },
      correctAnswer: "C"
    },
    {
      question: "Қалыптастырушы бағалау мыналарға бағытталған:",
      options: {
        "A": "қорытынды баға қою",
        "B": "білім алушыны дамыту және қолдау",
        "C": "жазалау",
        "D": "есеп беру"
      },
      correctAnswer: "B"
    },
    {
      question: "Педагогтың беделі мыналарға негізделеді:",
      options: {
        "A": "тәрбие әдістерін қолдану",
        "B": "білім алушылармен спорттық іс-шараларға қатысу",
        "C": "ата-аналармен жүргізілетін іс-шаралар",
        "D": "кәсібилік пен жеке үлгіге"
      },
      correctAnswer: "D"
    },
    {
      question: "Білім алу құқыға кепілдік беріледі:",
      options: {
        "A": "мемлекет заңнамасымен",
        "B": "мектеп",
        "C": "жаттықтырушы",
        "D": "ата-аналар"
      },
      correctAnswer: "A"
    },
    {
      question: "Қолжетімділік принципі мынаны білдіреді:",
      options: {
        "A": "материалды ең төменгі деңгейге дейін жеңілдету",
        "B": "күрделі тақырыптарды алып тастау",
        "C": "оқыту мазмұнының жас ерекшеліктері мен жеке ерекшеліктеріне сәйкес болуы",
        "D": "ешқандай талаптың болмауы"
      },
      correctAnswer: "C"
    },
    {
      question: "Өздігінен білім жетілдіру дегеніміз:",
      options: {
        "A": "бақылау",
        "B": "есеп беру",
        "C": "жарыс",
        "D": "білім мен біліктілік деңгейін өз бетінше арттыру"
      },
      correctAnswer: "D"
    }
  ],
  11: [
    {
      question: "Дене мәдениеті мен спортта педагогикалық зерттеу әдістерінің қайсысы басқарушы болып есептелінеді:",
      options: {
        "A": "Сұрау.",
        "B": "Педагогикалық бақылау.",
        "C": "Педагогикалық эксперимент.",
        "D": "Хронометраж."
      },
      correctAnswer: "C"
    },
    {
      question: "Дене жаттығуы -- бұл:",
      options: {
        "A": "Дененің іскерлігі мен дағдысын қалыптастыруға бағытталған",
        "B": "Дене тәрбиесінің міндеттерін заңдылықтарымен іске асыратын",
        "C": "Дененің морфофункциялық жұмыстарын өзгертуге бағытталған",
        "D": "Дененің құрылысын, қозғалыс сапаларын өзгертуге бағытталған"
      },
      correctAnswer: "B"
    },
    {
      question: "Бастапқы оқыту кезеңіндегі қимыл-қозғалыстың әдіс-айласын үйретудегі мақсат:",
      options: {
        "A": "Қозғалыс іскерлігін қалыптастыруды аяқтау.",
        "B": "Қимыл-қозғалыстың әдіс-айласын бекітіп, бөлшектеп игеру.",
        "C": "Үйренетін қимыл-қозғалыс бөлшектері мен фазаларын тұтас және",
        "D": "Қозғалыстағы әдіс-айласын үйретудің негізін қалыптастырып, оны"
      },
      correctAnswer: "C"
    },
    {
      question: "Адамның аз уақыт ішіндегі көрсететін қозғалыс мүмкіндігін қалай атаймыз:",
      options: {
        "A": "Жылдамдық қабілеті.",
        "B": "Қозғалыс реакциясы.",
        "C": "Жылдамдық-күш қабілеті.",
        "D": "Қозғалыс жиілігі."
      },
      correctAnswer: "A"
    },
    {
      question: "Қосалқы ойыншылардың біреуін тек бір-ақ рет ауыстырады (гандбол):",
      options: {
        "A": "қорғаушыны",
        "B": "шабуылшыны",
        "C": "қақпашыны",
        "D": "ортаны"
      },
      correctAnswer: "C"
    },
    {
      question: "Жүгіру жолында мәреден кейін бос жер болуы қажет:",
      options: {
        "A": "4--5 м",
        "B": "1--2 м",
        "C": "7--8 м",
        "D": "12--15 м"
      },
      correctAnswer: "D"
    },
    {
      question: "Қысқа қашықтыққа жүгіру кезінде сақталуы тиіс қауіпсіздік ережесі:",
      options: {
        "A": "орташа қарқынмен жүгіру",
        "B": "тек қана өз жолымен жүгіру",
        "C": "ақырын жылдамдықпен жүгіру",
        "D": "барынша жылдам жүгіру"
      },
      correctAnswer: "D"
    },
    {
      question: "Шаңғымен төбеден түскен кезде көп қолданылатын әдіс",
      options: {
        "A": "орташа отырып",
        "B": "айналып",
        "C": "тік тұрып",
        "D": "толық отырып"
      },
      correctAnswer: "B"
    },
    {
      question: "Ерлер жүгіретін қысқа қашықтықтағы кедергілердің биіктігі",
      options: {
        "A": "110,7",
        "B": "106,7",
        "C": "91,8",
        "D": "105,5"
      },
      correctAnswer: "D"
    },
    {
      question: "11--12 жастағы оқушылар пайдаланатын гимнастикалық таяқтың ұзындығы",
      options: {
        "A": "82--84 см",
        "B": "84--86 см",
        "C": "78--80 см",
        "D": "83--85 см"
      },
      correctAnswer: "B"
    },
    {
      question: "Айрықша қашықтық - марафон жүгірісі",
      options: {
        "A": "42 км 195 м",
        "B": "43 км 191 м",
        "C": "41 км 192 м",
        "D": "40 км 193 м"
      },
      correctAnswer: "D"
    },
    {
      question: "Қол добында ойыншы допты қанша уақыт ұстай алады",
      options: {
        "A": "4 секунд",
        "B": "2 секунд",
        "C": "1 секунд",
        "D": "3 секунд"
      },
      correctAnswer: "A"
    },
    {
      question: "Оқушылардың бірінің артынан бірі тұруы:",
      options: {
        "A": "сап",
        "B": "шеңбер",
        "C": "қатар",
        "D": "лек (тізбек)"
      },
      correctAnswer: "D"
    },
    {
      question: "Жоғары қарқынмен ұзақ жүгіру кезінде бұлшықет шаршауының негізгі себебі:",
      options: {
        "A": "Бұлшықет температурасының төмендеуі",
        "B": "Гликоген деңгейінің жоғарылауы",
        "C": "Қандағы және бұлшықеттердегі лактат концентрациясының жоғарылауы",
        "D": "Аэробты процестерді күшейту"
      },
      correctAnswer: "C"
    },
    {
      question: "Тыныс алу ауруларына жататыны.",
      options: {
        "A": "серезит.",
        "B": "туберкулез.",
        "C": "атеросклероз.",
        "D": "мешел."
      },
      correctAnswer: "B"
    },
    {
      question: "Қай спорт түрінде қозғалысты басқаруда үйкеліс күшінің рөлі ерекше маңызды?",
      options: {
        "A": "Шаңғы спорты",
        "B": "Гимнастика",
        "C": "Ұзындыққа секіру",
        "D": "Футбол"
      },
      correctAnswer: "D"
    },
    {
      question: "Қан допингін қолдану кезінде төзімділіктің артуының негізінде қандай механизм жатады?",
      options: {
        "A": "Жұмыс істеп тұрған бұлшықеттерге оттегінің тасымалдануының артуы",
        "B": "Альвеолярлық мембрана арқылы оттегінің диффузиясының жақсаруы",
        "C": "Тыныс алу жиілігінің артуы",
        "D": "Минуттық қан айналым көлемінің азаюы"
      },
      correctAnswer: "A"
    },
    {
      question: "Ақуыздың энергетикалық құндылығы:",
      options: {
        "A": "1 ккал",
        "B": "9 ккал",
        "C": "4 ккал",
        "D": "5 ккал"
      },
      correctAnswer: "C"
    },
    {
      question: "Күштің дамуы:",
      options: {
        "A": "Буындардың ұлғаюы",
        "B": "Қанмен жабдықтаудың төмендеуі",
        "C": "Кальций шығыны",
        "D": "Бұлшық ет талшықтарының қалыңдығы"
      },
      correctAnswer: "D"
    },
    {
      question: "Педагогиканың әдіснамасы - бұл:",
      options: {
        "A": "сабақ жоспары",
        "B": "сабақ кестесі",
        "C": "ғылыми танымның қағидаттары мен әдістері туралы ілім",
        "D": "есеп беру түрі"
      },
      correctAnswer: "C"
    },
    {
      question: "Оқытуды дараландыру - бұл:",
      options: {
        "A": "бірдей тапсырмалар беру",
        "B": "әрбір білім алушының жеке ерекшеліктерін ескеру",
        "C": "талаптарды төмендету",
        "D": "бақылаудың болмауы"
      },
      correctAnswer: "B"
    },
    {
      question: "Кәсіби күйіп кету - бұл:",
      options: {
        "A": "физикалық дайындық",
        "B": "тәртіп",
        "C": "жарыс",
        "D": "эмоционалдық шаршау"
      },
      correctAnswer: "D"
    },
    {
      question: "Мемлекеттік стандарт мыналарды анықтайды:",
      options: {
        "A": "білім беруге қойылатын міндетті талаптар",
        "B": "сабақ кестесін",
        "C": "жүктемені",
        "D": "жарыстарды"
      },
      correctAnswer: "A"
    },
    {
      question: "Саналық және белсенділік принципі мынаны білдіреді:",
      options: {
        "A": "пассивті тыңдау",
        "B": "механикалық жаттау",
        "C": "білім алушылардың оқу процесіне саналы әрі белсенді қатысуы",
        "D": "қатаң бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Білім берудегі цифрлық технологиялар дегеніміз:",
      options: {
        "A": "баспа материалдары",
        "B": "ауызша сұрау",
        "C": "бақылау",
        "D": "ақпараттық-коммуникациялық технологияларды пайдалану"
      },
      correctAnswer: "D"
    }
  ],
  12: [
    {
      question: "Эксперимент деген терминді қалай түсінесің:",
      options: {
        "A": "Зерттеуге лайықты жағдай жасау.",
        "B": "Шет жағдайларды орнына келтіру.",
        "C": "Ғылыми-әдістемелік зерттеу.",
        "D": "Жетелеу әрекеттерін қалыптастыру."
      },
      correctAnswer: "C"
    },
    {
      question: "Жаттығуларды орындауда ағзада болатын негізгі процестер қалай аталады:",
      options: {
        "A": "Дене жаттығуларының түрі.",
        "B": "Дене жаттығуларының мазмұны.",
        "C": "Дене жаттығуларының құрылысы.",
        "D": "Дене жаттығуларының әдіс-айласы."
      },
      correctAnswer: "C"
    },
    {
      question: "Әдіс-айласы күрделі болмаса, оны дереу орындау дұрыс:",
      options: {
        "A": "Бөлшектеп, одан соң біріктіру.",
        "B": "Әр түрлі ойын жағдайында (ойын тәсілі).",
        "C": "Әр түрлі жарыс жағдайында: «кімдікі дұрыс», «дәл тигізу»,",
        "D": "Тұтас орындау."
      },
      correctAnswer: "B"
    },
    {
      question: "Қозғалысты үлкен амплитуда жасау қабілетін қалай атаймыз:",
      options: {
        "A": "Иілгіштік.",
        "B": "Созылымдылық.",
        "C": "Үзілісті.",
        "D": "Созылмалы."
      },
      correctAnswer: "D"
    },
    {
      question: "Екі аяқты алшақ ұстап, жүрелеп отыру, денені және қолды бүге отырып, басты еңкейтіп тізеге таяп, аяқпен сәл демеп аударылып түсу:",
      options: {
        "A": "көпір жасау",
        "B": "артқа домалау",
        "C": "алға домалау",
        "D": "жауырынға тұру"
      },
      correctAnswer: "A"
    },
    {
      question: "Екі саптан бір сапқа ауысқан кезде, екінші қатарда тұрған оқушылар «бір» пәрмені берілгендегі қимылы:",
      options: {
        "A": "сол аяқпен оңға",
        "B": "сол аяқпен артқа",
        "C": "оң аяқпен алға",
        "D": "сол аяқпен солға"
      },
      correctAnswer: "B"
    },
    {
      question: "Бес тас ойынында қақпа тасты (сака) лақтыра отырып, қалған төрт тасты бір-бірлеп екінші қолдың алақанына жинайды:",
      options: {
        "A": "бірлік",
        "B": "алақан",
        "C": "жалақ",
        "D": "екілік"
      },
      correctAnswer: "D"
    },
    {
      question: "Шаңғышыға қойылатын талаптар",
      options: {
        "A": "жеңіл әрі жел өтпейтін киім кию керек",
        "B": "барынша қалың киініп алу керек",
        "C": "мұздың үстінде шаңғымен жүгіру керек",
        "D": "резеңке табанды аяқ киім кию керек"
      },
      correctAnswer: "B"
    },
    {
      question: "Дене тәрбиесінің міндеттері",
      options: {
        "A": "дамыту, сауықтыру, білім беру",
        "B": "сауықтыру, білім беру, тәрбие",
        "C": "тәрбие, дене жаттығулары, ойындар",
        "D": "білім беру, ойындар, оқыту"
      },
      correctAnswer: "A"
    },
    {
      question: "Волейболда ойынға қосылған допты қабылдаудың ең сенімді тәсілі",
      options: {
        "A": "жоғарыдан қабылдау",
        "B": "тосқауыл қою",
        "C": "төменнен қабылдау",
        "D": "алақанмен, тізені бүгіп, үстінен"
      },
      correctAnswer: "B"
    },
    {
      question: "Жеңіл атлетикада сөреге дейін бос жер болуы қажет",
      options: {
        "A": "3-5 метр",
        "B": "13-15 метр",
        "C": "8-10 метр",
        "D": "1-2 метр"
      },
      correctAnswer: "C"
    },
    {
      question: "Қол доп ойынының отаны ол",
      options: {
        "A": "Ресей",
        "B": "Қытай",
        "C": "АҚШ",
        "D": "Дания"
      },
      correctAnswer: "B"
    },
    {
      question: "Философия ғылымындағы тәсілдерді тану мен болмысты өзгерту, дүниетануда принциптерді қолдануды не деп атайды:",
      options: {
        "A": "Әдістеме.",
        "B": "Әдістемелік тәсіл.",
        "C": "Әдіснама.",
        "D": "Әдіс."
      },
      correctAnswer: "D"
    },
    {
      question: "Бұлшықет жасушаларының ацидозы қандай салдарға байланысты дамиды:",
      options: {
        "A": "Оттегі концентрациясының жоғарылауы",
        "B": "Лактат деңгейінің төмендеуі",
        "C": "Анаэробты алмасу өнімдерінің жинақталуы",
        "D": "Липолиздің жоғарылауы"
      },
      correctAnswer: "C"
    },
    {
      question: "Біріншілік несепті сүзуге қатысатын бүйрек тамырлары:",
      options: {
        "A": "перитубулярлы капиллярлар торы",
        "B": "бүйрек денешігінің гемокапиллярлары",
        "C": "бүйрек денешігіне қанды алып келетін артериолалар",
        "D": "бүйрек денешігінен қанды алып кететін артериолар"
      },
      correctAnswer: "B"
    },
    {
      question: "Батутта секіру кезінде спортшылардың потенциалдық және кинетикалық энергияны алмастырып отыруын қандай заң түсіндіреді?",
      options: {
        "A": "Инерция заңы",
        "B": "Масса сақталу заңы",
        "C": "Тепе-теңдік заңы",
        "D": "Энергияның сақталу заңы"
      },
      correctAnswer: "D"
    },
    {
      question: "Спортшылардың жүрек-қантамыр және тыныс алу жүйелеріне әсер ететін тыйым салынған заттардың тізімін анықтайтын халықаралық ұйым:",
      options: {
        "A": "Дүниежүзілік антидопинг агенттігі (WADA)",
        "B": "Халықаралық Олимпиада комитеті",
        "C": "Ұлттық федерациялар, медициналық орталықтар",
        "D": "Спорттық клубтар мен федерациялар"
      },
      correctAnswer: "A"
    },
    {
      question: "Төмендегілердің қайсысы қан клеткасының құрамына кірмейді?",
      options: {
        "A": "эритроциттер",
        "B": "лейкоциттер",
        "C": "нейтрофилдер",
        "D": "тромбоциттер"
      },
      correctAnswer: "C"
    },
    {
      question: "Қыздырыну керек:",
      options: {
        "A": "қан ағынының азаюы",
        "B": "Температураның төмендеуі",
        "C": "Белоктардың бұзылуы",
        "D": "Жарақаттардың алдын-алу"
      },
      correctAnswer: "D"
    },
    {
      question: "Зерттеудің теориялық әдістеріне мыналар жатады:",
      options: {
        "A": "жарыс",
        "B": "қыздыру жаттығулары",
        "C": "талдау және синтез",
        "D": "күшті тестілеу"
      },
      correctAnswer: "C"
    },
    {
      question: "Мотивация - бұл:",
      options: {
        "A": "бақылау",
        "B": "іс-әрекетке ынталандыру",
        "C": "жазалау",
        "D": "жарыс"
      },
      correctAnswer: "B"
    },
    {
      question: "Білім берудегі инновация - бұл:",
      options: {
        "A": "сабақтарды тоқтату",
        "B": "білім берудеге бақылау көрсеткіштері",
        "C": "білім беруде қолданылатын жазалау әдістері",
        "D": "жаңа технологиялар мен әдістерді енгізу"
      },
      correctAnswer: "D"
    },
    {
      question: "Білім алушылардың құқықтарына мыналар жатады:",
      options: {
        "A": "сапалы білім алу",
        "B": "оқудан бас тарту",
        "C": "білім алушылардың білімін толықтыру",
        "D": "ережелерді елемеу"
      },
      correctAnswer: "A"
    },
    {
      question: "Педагогикалық процестің тұтастығы дегеніміз:",
      options: {
        "A": "тек тәрбие",
        "B": "тек оқыту",
        "C": "оқыту, тәрбиелеу және дамытудың өзара байланысы",
        "D": "білімді бақылау"
      },
      correctAnswer: "C"
    },
    {
      question: "Аралас оқыту дегеніміз:",
      options: {
        "A": "тек онлайн оқу",
        "B": "тек дәстүрлі оқу",
        "C": "факультатив",
        "D": "дәстүрлі және қашықтан оқыту форматтарының үйлесіі"
      },
      correctAnswer: "D"
    }
  ]
};

export function getTestQuestions(language: 'russian' | 'kazakh' | 'ru' | 'kz', variant: number): QuestionData[] {
  // Конвертируем ru/kz в russian/kazakh для совместимости
  const lang = language === 'ru' ? 'russian' : language === 'kz' ? 'kazakh' : language;
  // ... rest of the code remains the same ...
  if (lang === 'russian') {
    return russianTestQuestions[variant] || [];
  }
  return kazakhTestQuestions[variant] || [];
}

export function getCorrectAnswersFromQuestions(questions: QuestionData[]): Record<number, string> {
  return questions.reduce((acc, question, index) => {
    acc[index + 1] = question.correctAnswer;
    return acc;
  }, {} as Record<number, string>);
}
